[
  {
    "asin": "B01GGKYKQM",
    "text": "This cord functions exactly as you would expect. I mainly purchased this because I wanted this particular length. It's nice to have a longer cord when on a trip in case the available seating is unfortunately quite a distance from the outlet. Overall, I'm pleased with this purchase and I think the Amazon essentials product functions just as well as the more expensive brands.",
    "title": "Practical and Useful Cord",
    "location_and_date": "Reviewed in the United States on June 3, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "got it while they are on sale.  so  happy with the price and the length of the cable",
    "title": "long, what else do you want from it?",
    "location_and_date": "Reviewed in the United States on June 1, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I got a 2020 Honda CR-V a few weeks ago. First vehicle I've had with Android Auto support (or Car Play but I haven't owned a iPhone since the iPhone 4, just personal preference).Anyways when I first got it I couldn't not get Android Auto to work. I tried everything I could find online about the problem and you can find plenty of people that have/had trouble getting it to work in their Honda CR-V (ironic since the infotainment system runs on android). Tried doing a full factory reset on the infotainment system, turning on USB debugging in dev settings, and the 2 dif USB type C to USB type A cable I had. No matter it would not work. My phone would charge when plugged in but that's it. A message is supposed to pop up on the infotainment system asking if you want to enable android auto.I bought this cable as a last resort. I made sure to get a USB 2.0 and NOT a USB 3.0 type C to USB type A cable. Didn't think it would make a difference. Got in the car, turned it on, plugged the cable into the car, then into my phone, and BAM the \"do you want to enable android auto\" message instantly pops up on the infotainment system. And it works perfectly. Love it.",
    "title": "Couldn't get Android Auto to work in my new car, this cable did the trick!",
    "location_and_date": "Reviewed in the United States on March 17, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This cable allows me to charge the Fire tablet while being able to use it without confining myself to the short length of the cable that came with the tablet.  The charging time is comparable to that of the cable that came with the tablet.  It was reasonably priced, so I bought two.  So far, so good!",
    "title": "Reliable and reasonably priced",
    "location_and_date": "Reviewed in the United States on May 5, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "My experience with Amazon Basic products is that you get Quality Products for a Great Price! And, this cable is no different. The cable does everything advertised.  And, there's one thing I've learned as a buyer on Amazon is that AMAZON does not put their name on anything unless it's GOOD QUALITY.  So far, I've always been happy with Amazon Basics Products and I never worry about my purchase.",
    "title": "A Quality Cable that Does the Job.",
    "location_and_date": "Reviewed in the United States on May 2, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "it works great for charging my vapes and has a decent length cord",
    "title": "does what it’s supposed to",
    "location_and_date": "Reviewed in the United States on May 31, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "These short cords are perfect to use with a USB HUB in order to create a USB charging hub for your devices.",
    "title": "Perfect for a creating a charging hub",
    "location_and_date": "Reviewed in the United States on May 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought a product which needed this kind of cable. My iPhone is a newer model, but the product I ordered did not use the cord or the charging station that I have. I’m always reluctant not to purchase Apple products, but this Amazon cable is just as good and the price point is fabulous. I only believe in giving honest reviews. I am a Vine member, but I paid for this product. Even when I receive the Vine products, I will rate them as if I did purchase them. If you do need this kind of cable, I highly recommend it, thus, the five stars.",
    "title": "Just As Great As Apple",
    "location_and_date": "Reviewed in the United States on April 13, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I recently purchased the Amazon Basics USB A to USB C cable and wanted to share my experience with fellow shoppers. Overall, the cable does its job well, but there are a few aspects worth mentioning.First, let's talk about the positives. The cable functions reliably and effectively connects my USB A devices to my USB C devices. I haven't experienced any connectivity issues or data transfer problems so far, which is crucial when it comes to cables.However, one notable drawback of this cable is its stiff jacket. The cable's outer covering feels rigid and inflexible, making it a bit challenging to maneuver and position as desired. Although this stiffness can be attributed to the cable's durability, it may be a point of concern for those seeking a more flexible and pliable option.That being said, if you're primarily looking for a durable cable that can withstand some wear and tear, this might be a suitable choice for you. The cable's build quality appears to be solid, and it feels sturdy enough to last for an extended period. Just keep in mind that the trade-off for this durability is the cable's rigidity.",
    "title": "Reliable Cable with Stiff Jacket",
    "location_and_date": "Reviewed in the United States on June 2, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I buy my phones from TracFone, and there's usually a charging cord included. However, this newest cord with the phone doesn't stay securely plugged in and tends to pop off when I move the device. I ordered this one, hoping for better results. This cord stays plugged into my phone better than the other one, is a good length, works great. Winner!",
    "title": "Better fit",
    "location_and_date": "Reviewed in the United States on April 25, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This product works well and does what it is supposed to do. The battery life on PS5’s controllers are awful, so needed a longer cord so I could play from my couch. Works really well",
    "title": "Needed a longer cord for my ps5 controller",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 12, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Worth it. works great. charges fast and it’s long",
    "title": "Great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 27, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works fine for my IPad Air 4th gen. Hope it holds up.",
    "title": "Works fine",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "",
    "title": "Great length, fairly well made. Lasted about 2 1/2 years before coming apart at the connector.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 29, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges all of my Type-C devices.",
    "title": "Works perfeclty!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 26, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": ".. stopped working shortly afterwards.  Amazon quickly replaced it for free without having to return the old cable.  Hey, **it happens, still a good experience.",
    "title": "Worked great, but..",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 6, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does what it's supposed to do. Works great.",
    "title": "Its a usb cord that does usb cord stuff.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 22, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "No problems!",
    "title": "Great charger",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 26, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "👍",
    "title": "works on xbox controller",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 28, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The charger was packaged Great. Charger looks well made and chargers my phone well. Highly recommend for the price.",
    "title": "Great Charger, Great Build Quality. Works well.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 12, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I purchased this cable to use with Spotify Car Thing to use the display/controls at my desk. The cable shipped with the Car Thing from the manufacturer was defective and constantly had issues. This cable from Amazon Basics has worked great and I have had no issues.",
    "title": "Works great with Spotify Car Thing",
    "location_and_date": "Reviewed in the United States on April 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The Cooler Master SK630 keyboard connects to the computer via a detachable USB-C cable. The problem is the spot it plugs into is recessed somewhat and has very little clearance on either side. That means that most USB-C cables out there won't be able to plug completely into it making the keyboard useless.The C connector on this cable, though, is just small enough that it fits into that spot! Now my keyboard is back up and running.",
    "title": "Good replacement cable for Cooler Master SK630 keyboard",
    "location_and_date": "Reviewed in the United States on April 7, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "ok",
    "title": "ok",
    "location_and_date": "Reviewed in the United States on May 22, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Super affordable, does the job just like an Apple product, and arrived after 1 day! Bought this one because Apple products for USBC accessories are very expensive. Definitely recommend!!",
    "title": "MacBook compatible and works like a charm!",
    "location_and_date": "Reviewed in the United States on May 2, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does the job of connecting my touch screen the the Radio.",
    "title": "About as good as it gets.",
    "location_and_date": "Reviewed in the United States on May 2, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "They are perfect. Thanks",
    "title": "Cell phone charger",
    "location_and_date": "Reviewed in the United States on May 13, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The product arrived quickly, I plugged it in and no issues, bought another one.",
    "title": "Arrived Fast Good Quality",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It works great thanks!",
    "title": "Works Perfect!",
    "location_and_date": "Reviewed in the United States on May 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charge my iPad mini",
    "title": "Works perfectly!",
    "location_and_date": "Reviewed in the United States on May 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does what it should",
    "title": "Works as expected",
    "location_and_date": "Reviewed in the United States on May 8, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "As advertised.",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on April 27, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges phone quickly.",
    "title": "Charges Phone",
    "location_and_date": "Reviewed in the United States on May 11, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Ordered two of these and I highly recommend. Great price and rapid charging. After I saw how good these were I ordered two more. GREAT QUALITY PRODUCT.",
    "title": "Rapid charging",
    "location_and_date": "Reviewed in the United States on April 21, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It was as described.",
    "title": "Great! As described.",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great Buy",
    "title": "Great Buy",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Funciona excelente",
    "title": "Buena calidad",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed a way to charge my iPad from an external battery when our power went out.  My external batteries only have the older usb ports.  So these filled that need.",
    "title": "Perfect for my purpose",
    "location_and_date": "Reviewed in the United States on April 15, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Esperaba un cable como todos los genéricos ya que no buscaba uno en especial, pero este Cable USB Tipo C de Amazon tiene una muy buena calidad.Recomendado!",
    "title": "BUENA CALIDAD",
    "location_and_date": "Reviewed in the United States on April 16, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed a longer charging cord to relocate the chargers away from under my rolling chair base to prevent crushing damage, and this one let me put the chargers on the other side of my desk from the chair.",
    "title": "It fits",
    "location_and_date": "Reviewed in the United States on April 10, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges fast but on rare ocassion my phone will indicate slow charging. Just have to unplug and plug back in and that usually fixes the problem.",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on March 25, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Excellent charger  and fast charging",
    "title": "Great product",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 25, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "So far so good. It charges fast my phone and tablet",
    "title": "Fast charge",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Worked as expected.",
    "title": "Good buy",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 28, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "People seem to have a lot of opinions about cables, in terms of what's good, what lasts, and so on. That is not an argument that I care to wade into. What I can say is that I have bought a number of different kinds of Amazon Basics cables over the years, and had good luck with them. So far, this cable appears to be no exception to that rule. The quality seems good, charging is fast, and it seems nicely made for the price.",
    "title": "It's a cable. What do you want?",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 10, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Fits",
    "title": "Wire",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 9, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is probably the best cable I have bought.i bought a lot.im a delivery person and plug and unplug about 75 times a day..so far so good.",
    "title": "Fast charging",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 7, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "For switch lite, playing when charging decreases the battery. I guess it’s good for preventing gaming addiction haha. Also the cord length is short; only 4 times my foot. I guess these cons are for cutting the price*Edit: I just learned charging time is by the type of plug instead of the cord haha",
    "title": "Doesn’t work well with Switch (lite)",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 26, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "These cords are perfect.  The length is great and the durability seem solid.  I'm always nervous about buying off-brand cords but these seem great.",
    "title": "Always nervous about buying off-brand cords!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 4, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Some chargers (“bricks”) coming with newer devices have USB-C input jacks, which is usually just fine. But sometimes I have a need to charge a device which had USB-C Jack by plugging the other end of the cord into a USB-A jack. This adapter allows that.",
    "title": "USB-A to USB-C adapter",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 21, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Would be 5 star if it was more flexible like the cloth coated types out there.",
    "title": "Great cable, I just wish it was more flexible and not so stiff.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 16, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great price. Expidious shipping. Good job!  Make the hassle of cell charging in your vehicle a cinch if you have a USB port. Get rid of the cigarette lighter plug-in mess.",
    "title": "Car charging made easy.",
    "location_and_date": "Reviewed in the United States on February 26, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Had it for about a month then the cord split right under where the charger goes in. I put on some electric tape and it's all good since then. Hopefully it holds until I get another one. Probably not one of these though",
    "title": "Cord tore quick",
    "location_and_date": "Reviewed in the United States on May 31, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bye bye \"honey did you take my charging cord again?\" -- or at least most of the time. You'll still be accused of cord theft at least once a week. But -- but -- at least you won't be out of cords next time. And that may be the difference that let's you keep your dignity for another night.",
    "title": "Good value, reduces marital dis-cord by at least 75%",
    "location_and_date": "Reviewed in the United States on March 15, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Very good cable but not the most durable",
    "title": "Does what you need it to do",
    "location_and_date": "Reviewed in the United States on April 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It’s a good durable cable. Worth the money.",
    "title": "As advertised",
    "location_and_date": "Reviewed in the United States on April 11, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "i ordered this for charging a Lost Mary by Elf Bar, Apple brand chargers don’t work on them for whatever reason, so this cord works great, no issues and i ordered this weeks ago. :)",
    "title": "pretty good",
    "location_and_date": "Reviewed in the United States on March 21, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It was exactly what I expected.",
    "title": "As expected",
    "location_and_date": "Reviewed in the United States on April 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Needed this to charge up a USB-C device that did not come with charge cord.  Worked well, good length, good build quality, decent price",
    "title": "Works well to charge up USB-C device",
    "location_and_date": "Reviewed in the United States on February 23, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is a heavy duty USB cord and kind of stiff. If you want a real flexible cord that easily drapes this is not the cord to get. I like the length and build however. Very sturdily made.",
    "title": "A stiff one!",
    "location_and_date": "Reviewed in the United States on February 5, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I love these cords I will be buying again",
    "title": "Great cord",
    "location_and_date": "Reviewed in the United States on April 4, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good quality, use to charge my Bluetooth headset",
    "title": "good value for the price",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 5, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Just as described",
    "title": "Works great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Basic cable",
    "title": "Cable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 10, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great for use with 3rd generation Apple TV, which does not come with a charge cord.",
    "title": "Works with Apple TV 3rd Generation 4K",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 30, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "They charge your phone real quick I love mine",
    "title": "Love mine",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 3, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed to replace the cord for my Samsung Galaxy phone. The wires on the old one were beginning to be exposed at the phone-side plug. This chord fit perfectly, charges the phone just like the old cord, and is the same color and length as the old cord.",
    "title": "Just The Replacement I Was Looking For",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Nothing special but works well and that’s all I care about",
    "title": "Good cord",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 3, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed to use this so I could use my phone in bed. It was great for months but after a couple of months the cable bends and the cables gets exposed. It still works but its something you should be aware of if you're thinking of buying this.",
    "title": "Useful",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 4, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It's actually certified, which is a huge plus compared to the abundance of other off brand cables.  It is much thinner than the Anker and Belkin cables, so iam concerned about durability.",
    "title": "Good cable but thin",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 14, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It’s works just as it should",
    "title": "Works",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 21, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I just hope it lasts.",
    "title": "Convenient for traveling. I like everything about it",
    "location_and_date": "Reviewed in the United States on March 31, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good purchase!! It's durable and works very good for my android phone.  Will buy another one to use at work",
    "title": "USB Cord",
    "location_and_date": "Reviewed in the United States on March 19, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I had hoped I it would fit my hand bug zapper.  It arrived on time and great shape.  I will hold on to it and hope it wl fit something else.",
    "title": "Won't fit my item.",
    "location_and_date": "Reviewed in the United States on January 15, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "These stack up to the high end ones I purchased for a lot more.",
    "title": "Worth the money.",
    "location_and_date": "Reviewed in the United States on March 25, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This was just the right length that I needed.  Works great.",
    "title": "Good Basic Cable",
    "location_and_date": "Reviewed in the United States on March 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Cheap, works fine",
    "title": "Cheap, works fine",
    "location_and_date": "Reviewed in the United States on March 29, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charging of a smart tv remote vs solar poweroption",
    "title": "Good value",
    "location_and_date": "Reviewed in the United States on March 22, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "A while back I bought a Bushnell Phantom 2 Golf Rangefinder.  It's a great rangefinder but it came with a 6 foot USB C charging cord.  I have a charging station set up to charge up to 5 different devices and it only requires a short cord. This one works really well.",
    "title": "Needed a Shorter Cord",
    "location_and_date": "Reviewed in the United States on December 17, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Glad I oder them",
    "title": "Yeah",
    "location_and_date": "Reviewed in the United States on March 27, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cord does the job well, except that the USB-C plug tends to fall out of the charging port of my phone fairly easily. Every other USB-C cord that I plug into my phone stays firmly secure, so I have to assume that the problem is with the cord and not my phone.",
    "title": "Works well, but comes unplugged easily",
    "location_and_date": "Reviewed in the United States on April 25, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This charger works better than the original charger that came with the phone.",
    "title": "Better than the Samsung charger",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 18, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "These USB charging cables are exactly as advertised and a tremendous value. The arrived within 48 hours. I couldn’t be more satisfied with this purchase.",
    "title": "Excellent value",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 8, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "How wonderful Samsung was when they shipped the Galaxy A23 5G, maybe I was the lucky winner but... the charge cord in the box was a micro USB and the phone requires USB to USB Tyoe C! This charging cord works. What else can one say.",
    "title": "Work like OEM Cable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 20, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This cord has a lot of potential!Pros- this is the fastest charger I've used in the past 20 years! It works perfectly in charging my phone lightning fast. And it's a great price!Cons- it's been almost exactly a month and the cord is already frayed to the point of having to handle it very carefully. (See pic)If Amazon made it more durable or sold it as a set with some cord savers, I'd stock up on these so quick!",
    "title": "Fast Charging. Not Durable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 26, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Exactly as described when I received them. Arrived on time and work perfectly.",
    "title": "Cords worked great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 14, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Does the job, holds up well, nothing abnormal, but it's definitely not poorly constructed.",
    "title": "Get what you pay for",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 15, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It did what was expected",
    "title": "Charger",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 20, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It's a durable product, works well with data transfer, and also charging. If you need a quick order for a type-c cord, this is the product for you!",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 20, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use it to recharge my phone from a portable charger.  My old cord finally stopped working.  This cord seems to charge my phone much faster than the old one did.",
    "title": "Works great, price was ok",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 27, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I can confirm that the Amazon Basics USB Type-C to USB-A 2.0 male charger cable works for the NUX MG-30 Guitar Modeler. Take notice of the different size options that are available.",
    "title": "Excellent Value",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Needed a cable to charge my phone while in my car. This works perfect to charge my pixel 6A in my Ford Edge.",
    "title": "Perfect cable to use in my car",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 7, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It's a durable product, works well with data transfer, and also charging. If you need a quick order for a type-c cord, this is the product for you!",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 20, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Nice and long and charges as it should!",
    "title": "Good Value",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 13, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "A year or two ago we got both our kids Amazon tablets for Christmas. With that said, we have some how broken one charger and then some how lost the only working charger! I found these and jumped on ordering them! They are wonderful for the price!!! They are a lot longer than the ones that came with them, but seem like they will hold up longer. Great buy!",
    "title": "Bought for Amazon tablets and love them!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 11, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It arrived.  I used it.  It works.  It's a charging cable and it charges things.",
    "title": "If you need one like this, buy it.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 5, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Need cord organization",
    "title": "Always misplacing cords",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 12, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "6' as advertised.",
    "title": "As advertised",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 17, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great product so far! Great price!",
    "title": "Great product so far! Great price!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 16, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Let it be know that this is a full use (power and data) cable for connecting USB  type C devices to USB type A computers (or hubs). It was a pleasant relief since I wanted a data cable.",
    "title": "I use for data, so it's not just for charging.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 13, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I don’t know if it’s the charger or the new base from the same company, but is so slow my new iPad Pro would be at 17% and two hours later it’s at 32%",
    "title": "So slow",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 2, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "love it",
    "title": "love it",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 16, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Doesn't give any non compatible errors on computer or android auto.  Works well as it should",
    "title": "Good pretty durable option it seems.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 1, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Had little expectation, but was delighted that phone was charging using the old usb port in the car. Not super fast but was doing the job..",
    "title": "Works fast charging S22 cell phone",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 6, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works well",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 17, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought theses cords so that we can plug an  IPad Air into a USB outlet to charge it.  It saves having to carry yet  another charger around.  The cord does the job.",
    "title": "Use it as a charging cord for new Apple IPad",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 14, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Not broken when received like a different item purchase.",
    "title": "Works",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 10, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Nice product.",
    "title": "Great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 15, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Needed a cable to connect my computer to my phone. Works fine, no issues.",
    "title": "No issues with the product",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 1, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Purchased because my standard USB C cable was taking too long to charge my Samsung Galaxy in the car. Charges at regular fast charge speeds, not superfast charging. This cable feels quality, will order more! As expected from an Amazon Basics Item.",
    "title": "Well made, supports fast charging",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 29, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "was little skeptical because most after market cords will not work with all devices, this cord works well, highly recommend",
    "title": "it works well",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 21, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Wrong item bought for my need",
    "title": "Had it returned",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 28, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I purchased this cable so I could charge my Pixel phone with my USB car charger.",
    "title": "Required for car charger",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "There ii nothing wrong with the cable. But, I bought it to replace a lost charging cable for my Apple Earbuds.  The small end is the perfect shape, but it is too big to fit into the charging port of my Apple Earbuds.",
    "title": "Not compatible with Apple Earbuds",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 25, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use it daily and it's fine",
    "title": "it's perfect, it does the job",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 4, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Simple and good quality",
    "title": "Good cable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 8, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works perfect",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 10, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "They work great. They read the fast charging boxes so you should be good. Definitely recommend.",
    "title": "This is my second Amazon charger",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 22, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works for a charging base at my desk where the outlet was too far.",
    "title": "Cheap and works",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great charging cable for other stuff and transferring data to your laptop like pictures,  e.t.c however does NOT work with Android Auto compatible cars.  I tried it on my 2017 Honda Accord and got nothing (only charging capabilities).",
    "title": "Is NOT compatible with Android Auto",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 20, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "No issues.",
    "title": "Worked as intended",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 7, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good charger",
    "title": "Na",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "i am using this product for my ipad.",
    "title": "it is very useful",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The length of the cord is great but charges really slow.",
    "title": "Not too impressed",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 3, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cord is great and easily plugs into the phone",
    "title": "Great Cord",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Arrived quickly, works well, fair price. Just what I needed.",
    "title": "Exactly what I needed",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It was good",
    "title": "It’s the right length",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 2, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "All good. No defects. good materials used. No odor.",
    "title": "does the job well.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 18, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Was a basic need to add a new external storage Drive in my IMac. Worked perfectly with no complaints. Looks clean and well made. Will buy from Amazon again in the future.",
    "title": "Cord for External Storage Drive",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 19, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "You can never go wrong with Amazon basics! Quality for a great price. Upon opening they came packages neatly with two charging cables. Decent length of cord not too long and not too short. Sits perfectly from bed stand to table. Ordered these a couple of months ago and still works!",
    "title": "Bang For Your Buck",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 15, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The product works on the 10th generation iPad. It doesn't seem to charge as quickly as the cable out of the iPad box but it is more than adequate.",
    "title": "Works as advertised.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Nothing fancy or frilly just a cord to keep us charged up",
    "title": "Just as expected",
    "location_and_date": "Reviewed in the United States on February 15, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works great charges my phone",
    "title": "Works great",
    "location_and_date": "Reviewed in the United States on February 20, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Used for a week and fell apart already",
    "title": "Broke already.",
    "location_and_date": "Reviewed in the United States on March 24, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It works fine",
    "title": "It works",
    "location_and_date": "Reviewed in the United States on November 24, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good quality ,good price ,Good deal. I'm pleased with this purchase.",
    "title": "Good deal",
    "location_and_date": "Reviewed in the United States on February 10, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "",
    "title": "So far, so good!",
    "location_and_date": "Reviewed in the United States on February 19, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have an expensive “pro” controller for my video game system.  The controller stopped holding a charge, but it would worked when on the charger.  My former cable was too short for comfortable gaming so I bought this cable for its length.  But, surprisingly the controller actually started charging once it was connected to the Amazon cable.  So, I am very happy with this purchase!",
    "title": "Good Cable",
    "location_and_date": "Reviewed in the United States on October 24, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Its been good so far",
    "title": "Good",
    "location_and_date": "Reviewed in the United States on February 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Perfect for travel/car cables.",
    "title": "Perfect for travel/car cables",
    "location_and_date": "Reviewed in the United States on November 6, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I ordered the longer length that I already had and I like it much better as it is much easier to use 👍🏻",
    "title": "I ordered the longer length and I like it better 👍🏻",
    "location_and_date": "Reviewed in the United States on September 28, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charge my phone well for a couple of weeks, then stopped working all together.",
    "title": "Meh",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 6, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works great",
    "title": "Great cord for the price",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 16, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have nothing bad to say about this Amazon product. It came as in the picture and works just fine.",
    "title": "So good, so far.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 15, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I mean, you could pick up the same looking cord at your local gas station for half the price, but this is backed by Amazon, so it must be good.  Since I'm using this in a 'static' application, I can't attest to the durability.",
    "title": "Cheap alternative that actually works.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 24, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does what its supposed to do, but I wished it was a tad longer.",
    "title": "Good bang for the buck!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 21, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works good",
    "title": "Great product works well",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 13, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It's a charging cable. What more is there to say?It does the job and is a very generic charging cable. I use it to charge my phone and no issues so far (after a month of daily use).",
    "title": "it's a charging cable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 28, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I like that it's really sturdy and fast charging!",
    "title": "Fast charger",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 26, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "They made the connection I needed.",
    "title": "THEY WORK CONSISTENTLY.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 29, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Maybe it worked a little TOO well, maybe it was user error and I wasn't supposed to use it on my earbud case--I don't know. All I know is that I bought this charger as a temporary replacement for my earbud case since the original charger stopped working (and ironically, the charger cables on the official brand site are completely sold out, hence turning to Amazon for a generic one). I have an older, nearly falling apart version of the earbuds that uses a different charger type, and I charge it with a generic charging cable--I haven't had a problem in the 2 years I've been using it. Hence my optimism doing the same for the new earbuds. I opened it as soon as it arrived and everything seemed great. I plugged it into my case and it charged just fine; in fact, it was just what I needed at the start. Cue a couple hours later.I unplugged the case, as it was fully charged, and was using my earbuds when all of a sudden--after about an hour of it being unplugged--there was a LOUD pop, sparks flew out of the case, and it began to smoke. I hurried and disposed of the case because obviously, but was confused because HOW??? The only reasons that come to mind is that the charger and earbud case just weren't compatible or I was sent a faulty charging cable. I don't know, I'm not a battery expert, but I DO know that lithium batteries aren't supposed to randomly explode within an hour of charging them. Just exercise EXTREME caution and monitor your devices if you do decide to purchases this charger, because no one wants lithium batteries to randomly explode in their house.",
    "title": "Could potentially cause your lithium battery to explode",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 21, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "That it changes quickly for my Samsung S8 cell phone.",
    "title": "Charges quickly and doesn't take up too much space.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Tested in my car to ensure it works for the android auto. So far no issue. The quality and value are awesome!",
    "title": "Better than expected",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 31, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "so far so good.",
    "title": "heated socks",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 28, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Simple basic cable that I use to charge an external battery pack and it works fine. Quality seems ok not great but for the price it’s fine.",
    "title": "Works as I expected it to",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 14, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The description says it will work with “any Type-C enabled device”. Maybe I’m just misunderstanding what “any Type-C enabled device” actually is. I would like a longer charging cable for my iPad Pro and I gambled, since it says it will work with another Apple product, (the MacBook), and lost. The cable might just as well be a piece of string with usb plugs. There is no response of any kind when I plug it in. Even an off brand lightning cable will say “this device may not work with this cable “. Returning it would just be more trouble than it’s worth. Giving it two stars is working on the assumption that it may actually work on “any Type-C enabled device”... except the iPad Pro! So, be careful and don’t get your hopes up. Especially if you want to use it for an Apple product.To be fair I could not find anywhere it said it WOULD work with the iPad Pro. 🌟🌟UPDATE: I does work! The charging cable that came with the iPad is instantly recognized so when I plugged the new one in and it didn’t immediately work I made the mistaken assumption that my new iPad just wouldn’t recognize this Non-Apple cord. It actually takes about 7-8 seconds to wake up and begin charging with this generic cable.So, 7 seconds is just fine with me and assuming it won’t burn out like the old Lightning cables did.I couldn’t be happier.If you found my review helpful, please let Amazon know by clicking the helpful button below!",
    "title": "It might just as well be a piece of string with usb plugs! UPDATED POSITIVE REVIEW!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 12, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It replaced an original cord whose connection to the phone was getting loose.  This one connects with the phone perfectly.  At least now I know it wasn't the phone's fault.",
    "title": "Very solid, secure connection.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 3, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This cable fixed Android Auto issues we were having completely. Our phones would sometimes disconnect or have issues connecting but this cable solved it.",
    "title": "Fixed Android Auto Issues",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 19, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It charges like it should the length isn’t long depending on how long you need",
    "title": "It charges",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Fit my rechargeable battery pack.",
    "title": "Perfect fit",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I got it specifically for my Android Auto for a better connection and it's been great",
    "title": "Works good with android auto",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 28, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Use it every day to charge my phone.  Needed the extra length.",
    "title": "Performs well at a great price",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Didn't last long before started glitching.",
    "title": "Glitching with ANDROID AUTO",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 16, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "use it in my car and have had no problems",
    "title": "Great product",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 1, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is exactly what I wanted, and it works great. Well worth the price, which was not that much.",
    "title": "USB Cable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 10, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "If I don’t unplug and plug back in the charger, nothing will happen. I need to do this every 45 minutes. Does the job, just annoying.",
    "title": "Needs to be continuously unplugged and plugged back in to work",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 18, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The 6-ft length allows charging while still using the device.",
    "title": "Perfect length for tablet and Kindle charging.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 25, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Plugged it into my new Kindle and my computer and it's charging as I sit here.  So far so good.",
    "title": "It Works",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 2, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Fit my needs exactly.  It works just fine.",
    "title": "Exactly what I needed",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 23, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Just needed something to charge my flashlight at work. My friend was getting tired of me borrowing his.",
    "title": "Works well for what I needed it for",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 30, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Worked well for 17 months. Now one of the cables has some internal damage so that it charges only when the USB-C end is bent almost 180 degrees.",
    "title": "Worked well for 17 months",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 6, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "More than met my expectations.....Outstanding Product.",
    "title": "Outstanding Product.",
    "location_and_date": "Reviewed in the United States on December 23, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is a good quality USB cable. I love the extra length and it charges quickly, too!",
    "title": "Good quality and great length!",
    "location_and_date": "Reviewed in the United States on December 2, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges my Google Pixel well. I'm pleased with the purchase.",
    "title": "So far so good",
    "location_and_date": "Reviewed in the United States on December 9, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Everything went fine, no issues",
    "title": "No Issues",
    "location_and_date": "Reviewed in the United States on December 21, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Amazon Basics USB Type-C to USB-A 2.0 Male Charger Cable, 3 Feet (0.9 Meters), White. These 3-foot white USB Type-C to USB-A 2.0 Male charger cables can connect USB-C enabled devices (MacBook, Chromebook Pixel, Galaxy Note 7, etc.) with standard USB-A enabled devices (laptops, hard drives, power banks, wall/car chargers, etc.). They are handy for charging, powering USB-C enabled devices, as well as syncing data, photos, and music. They boast up to 480 Mbps data transfer speed; power output up to 5V, 3 Amp.  They are reversible; the user can easily insert the Type-C connector into any Type-C enabled device (does not matter which side is up). And they are certified by USB-IF to be compliant with USB 2.0 Standard.Well, these are handy things to have  around in a world where they are frequently misplaced. Was once talking to a hotel maid who remarked that she often found them under beds, etc.  I lose them occasionally, usually at high-stress moments when  they’re really needed.  Glad to have a few. Like the 3-foot length for my car.",
    "title": "Handy things to Have  Around in a World Where They Are Frequently Misplaced",
    "location_and_date": "Reviewed in the United States on February 2, 2022",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Cheap, works as should. No issue with this product.",
    "title": "Works as should.",
    "location_and_date": "Reviewed in the United States on December 7, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Amazon basic brand is my go to brand for electronic accessories for its vetted quality. Bought 6 foot cord already and now buying more to lay around the house at my desk, sofa, recliner, and in my car. Easier than carrying one set of cords around. Found the 10 foot cord was too long which reduces charging speed, especially when paired up with lower mAh charger, or does not power the device at all. Pair a 10 footer only if you have a high capacity charger. Forget about QI wireless charging which have a higher charging demand. Disadvantage of using cords with plastic type covers vs braided type covers is that they are easier to tangle and inserts wrinkles went tightly wrapped and folded in. I installed a Velcro cord wrap you can buy at a home improvement store to avoid wrinkles when wrapping and storing the cord. The connector tip do break off if you step on them.",
    "title": "Amazon Basic Electronic Accessories are well built. 6 foot cords has advantages over 10 foot",
    "location_and_date": "Reviewed in the United States on December 26, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This charger is super slow for an iPad Pro 12.9",
    "title": "Super slow",
    "location_and_date": "Reviewed in the United States on January 18, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges super fast!",
    "title": "Great",
    "location_and_date": "Reviewed in the United States on December 29, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good item, good quality as expected related with the price.",
    "title": "Good item, good quality as expected related with the price.",
    "location_and_date": "Reviewed in the United States on December 1, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Work well",
    "title": "Good",
    "location_and_date": "Reviewed in the United States on December 31, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works well and quality built product.",
    "title": "Quality product",
    "location_and_date": "Reviewed in the United States on December 9, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great",
    "title": "Great",
    "location_and_date": "Reviewed in the United States on December 26, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Does what I need it to do. Not much to it. Cheap but works well",
    "title": "This sure is a charger",
    "location_and_date": "Reviewed in the United States on November 15, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I am using this to connect/charge an iPad Pro with a Magic Keyboard. I find that when the cable is connected directly to the iPad Pro it always charges successfully. When connected to the Magic Keyboard it will charge when plugged into my iMac or into the 2.1 amp port of my external battery or the 2.1 amp charging port on my car, but it will not charge when connected to an iPhone charging block or the normal charging port in my car. This is good enough for me. I also tried plugging it into my iMac to see whether I could mirror the screen as I can when using my old iPad with a Lighting connector. It didn't work. I assume the problems with charging are the capability of the charging block or the charging port, not the capability of the cable.",
    "title": "Mostly charges, but fails formeon data",
    "location_and_date": "Reviewed in the United States on October 5, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I recently got a new phone that uses a USB Type-C charger. All of my other devices used a micro USB, so I suddenly found myself without any spare USB cables that would work for my phone. This AmazonBasics cord, which has a USB Type-C on one end and USB-A on the other, works perfectly for me to charge my phone using my computer at work. It also works well with the \n  \nAmazonBasics 60W 6-Port USB Charger - Black\n\n\n\n\n\n\n\n  \n  \n    , which is what I use to charge all my devices overnight. The 6-foot cord gives ample room to move around while the phone is charging. I will say the charging speeds don't compare to the official Google charger that came with my Pixel, but as I'm basically using this as a backup charger, anyway, it's not a big deal.I have had one problem, and I don't know if it's computer or cord related: The first time I plugged this into my computer, my screen immediately snapped to thin, colorful, horizontal lines. My music kept playing in the background, but the screen was useless. I had to force shut down, and when I restarted, everything was fine. I've used the cord (in the same port on the same computer) multiple times since then with no trouble, but I thought it was worth mentioning.",
    "title": "Good back-up cord for USB Type-C devices",
    "location_and_date": "Reviewed in the United States on February 28, 2017",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Lo recomiendo 100%, es de aceptable calidad, y funciona excelente para conectar el celular a la Pc. Funciona excelente con SamsungDex.",
    "title": "Cable de carga USB tipo C a USB-A 2.0 macho (3.0 ft)",
    "location_and_date": "Reviewed in the United States on October 22, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does exactly what I was hoping it would do, and that is to charge my pixel XL.Most of the amazonbasics items that I've purchased have been stellar. It's almost like purchasing a generic version of something that's quite good, and getting a similar result from the product.This one is just a little disappointing. Not much, just a little.It doesn't plug in and remove quite as easily as the included charging cable. Once it's plugged in, it's a little difficult to remove. It just wants to stay plugged in.No problem with the USB side, just the type C side.It also does not charge quickly... the phone tells me that it's charging slowly, and I can tell that it takes longer as well.It looks as if none of the points will wear out anytime soon. Judging from the looks and feel, I expect it to last a while.",
    "title": "AmazonBasics Basic Cable",
    "location_and_date": "Reviewed in the United States on July 13, 2017",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "If you want to save a few cents buying and off brand, don't bother. These work perfectly for the money.",
    "title": "You won't find cheaper and more durable",
    "location_and_date": "Reviewed in the United States on October 20, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Exactly what I was looking for and works perfectly",
    "title": "Exactly what I was looking for",
    "location_and_date": "Reviewed in the United States on November 15, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It be working ngl",
    "title": "Charger",
    "location_and_date": "Reviewed in the United States on November 30, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is just what I wanted fast shipping good purchase",
    "title": "Just what I wanted",
    "location_and_date": "Reviewed in the United States on November 11, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It works great",
    "title": "Good price",
    "location_and_date": "Reviewed in the United States on November 30, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Excelente, me ha funcionado según esperaba, con carga rápida.",
    "title": "Cumple la función",
    "location_and_date": "Reviewed in the United States on November 8, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use this to charge a pedal, and it works fine.  Looks good.",
    "title": "Nice looking, work well,",
    "location_and_date": "Reviewed in the United States on October 23, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It shows about 5 hours to fully charge my Samsung S21. For my iPad 10th generation it say “not charging “ when connected.",
    "title": "Not for modern devices.",
    "location_and_date": "Reviewed in the United States on December 7, 2022",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Tried to use this to charge my phone from a USB type A charger to the USB type C connection...kept falling out of either the charger end or out of the type C on my phone.  Frustrating at best to use. Purchased a replacement cable while on the road that stayed in place...I guess you get what you pay for.",
    "title": "Barely adequate for USB charging",
    "location_and_date": "Reviewed in the United States on March 13, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good quality cord for charging cellphones.  Not all cords are alike, this one is a good one.",
    "title": "Good cord for charging",
    "location_and_date": "Reviewed in the United States on October 13, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have purchased and used dozens of Amazon Basics cables for displays and charging devices that do not need to be unplugged regularly (Think phone store displays). The latest batch of cables I bought are not even close to the the same quality I had received in the past. These cables are much thinner, have poor quality connectors, and slow charging speeds (if at all).2 of the cables will not provide power to brand new devices1 of the cables came with a a broken connector housingAll 5 cables will not stay plugged into a device that is immobile for more than 5 minutes.These cables to not meet the bare standard minimum required for a cable to be considered useful, and are e-waste. The only upside these cables provide is the length, which is not very useful if the cable does not work.",
    "title": "These cables are no longer reliable",
    "location_and_date": "Reviewed in the United States on May 10, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "USB C cables for charging, and even not so, are active cables, they have a chip in them that allows it recognize its position and what it can do.  So, I am very skeptical about $1 USB-C cables, not just that it would work, but continue to work after purchase and not destroy your gadget now or later.  Given the cost of the gadget,  and that cables last over the useful life of the gadget, getting a brand name I can hold accountable is better if not formally USB C certified.ProsI tested these cables using a Ruideng 25C and my phones Turbo Charger QC 2.0 mode.  The cable allowed current to 2.4A, as rated, and engaged the QC 2.0 mode, and works bidirectionally, as expected.  I used the cable for charging for over 1 week then installed it to charge a mounted phone on my car, but charging is only non-turbo modeQuality build by reputable brand, braided firm materialNo Cons",
    "title": "does the job for standard charging",
    "location_and_date": "Reviewed in the United States on January 6, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works well no problems",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on November 22, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Update: This cord still works after over a year as a frequently plugged in connector for Android Auto.  Ie. I keep the cord plugged into my car.  Actually still works though did not connect today for the first time.  It did after a while and maybe it will still be OK.  I have ordered a backup just in case.  That's good.  Around the 10 months mark there were a few days it was having a hard time connecting but then it worked again and has since. My last cords of another brand and similar price lasted about 3 months.  Those I still use to charge my phone at night but are not usable for Android Auto.",
    "title": "Update: Lasted 14 months so far as Android Auto connection",
    "location_and_date": "Reviewed in the United States on April 25, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This charger is comparable to other major brands; I see no difference in terms of durability or thickness of the cord or charging power. It is like getting one from a big retailer or tech store. I was hesitant because I thought it would only work for several months as most USB chargers do (e.g.  Getting the DREADED \"this accessory is not compatible with your device\"-message ) .Good news is that this USB charger has NOT frayed or given me that error message.I keep one at home, and one in my car for emergency use.",
    "title": "This is my 2nd repurchase",
    "location_and_date": "Reviewed in the United States on December 10, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "No.1",
    "title": "No.1",
    "location_and_date": "Reviewed in the United States on November 25, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I purchased this Amazon Basics USB C cable for use with my Nintendo Switch Pro controller.  I play with the controller plugged in because not allowing a battery to cycle full to empty extends its life (Modern batteries don't need to be \"power cycled\" regularly like older batteries did.)  I needed a cable that was long enough to reach the wall but not so long that it was a mess of cords that became a hassle.  I also needed one that was powerful enough to charge the controller.  I tested the controller by playing with it for a couple of days while not plugged in, and the battery level in the system didn't appear to go down any, so I couldn't judge exactly how fast this cable charges, but it charged it well enough for my use because the level has stayed full during my uses.Overall, I didn't find any flaws in using this Amazon Basics USB C cable with my Nintendo Switch Pro controller and highly recommend it for that application.  5/5 stars",
    "title": "Works perfectly with the Nintendo Switch",
    "location_and_date": "Reviewed in the United States on July 29, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Skinny min-spec to carry 3A cables. For the price I would expect a bit more caliber on the cables in both copper wire gauge and insulation/shielding.",
    "title": "Works, but look like cheap cables one would buy off of eBay but costs notably more",
    "location_and_date": "Reviewed in the United States on November 16, 2022",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Cord works fine.",
    "title": "Nice cord for the price",
    "location_and_date": "Reviewed in the United States on November 15, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have three spots in my flat where I charge my mobile devices so I can have them nearby as I charge them. I ended up wanting to have the cables for everything in each spot, and when I saw there was a 6-foot USB C cable I figured I'd give it a try. I was afraid a 6-foot cable might end up being too long, but instead, I found it was the perfect length. I now have one in each location, and I may buy another one for my purse so I can keep my emergency battery in my bag or a pocket while I use my phone as I shop or run errands.",
    "title": "I like it so much I've bought more of them",
    "location_and_date": "Reviewed in the United States on November 16, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "You can't go wrong with these usb c to A cable. Its made by Amazon basics and it is 6 feet long. I use these in a fast charging setup with Samsung galaxy phones and they work flawlessly. Sometimes I'll use this cable on the go attached to a rechargeable power bank. It also works great with my Samsung car charger. I use the Amazon basics USB C to A on my computer to phone to transfer pics from my computer to my phone and it works perfectly . These cables serve many purposes besides charging phones and devices. I highly recommend this cable to anyone looking for a low cost solution to charge their portable high tech devices .",
    "title": "Perfect for Samsung galaxy owners",
    "location_and_date": "Reviewed in the United States on March 31, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Must have been damaged after being transported in my backpack--but I don't' see how, as the pins are practically encased in the connector. Deducting a star for six-month longevity.Since I have few outlets in my home, the 9' is very handy in extending the reach. White helps spot the cord in the darkness of backpacks.",
    "title": "Somehow the middle pin on the USB-C side is missing",
    "location_and_date": "Reviewed in the United States on January 1, 2022",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Item is of good quality. Quality of the wrapping was first-rate. Quick delivery.",
    "title": "Charging power",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 5, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Powers up my Luna controller wonderfully!!",
    "title": "LUNA-SEEEEEEEEE....",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 27, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Worth the price, I highly recommend buying this",
    "title": "Awesome",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 15, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I am writing this review because the seller offered a $10 Amazon credit.This is almost a 5 star product.  It was delivered very quickly and upon opening the shipping package, I was very impressed with the product packaging.  It came in a little block back and the product name was nicely labeled.  Very good first impressions.  Upon opening the lilttle black box, I saw a card offering the afore mentioned credit in exchange for a review.  Next was two little sealed baggies.  At the bottom was the instruction manual.  I tore open the two baggies.  The headphones were in one.  In the other, ear bud accessories spilled out and rolled off my desk.  The baggies should be resealable so you can open an close the bag and not destroy it upon opening.The headphones were easy to pair to my phone.  The sound quality is very good.I would suggest that they proofread the copy, on both the instruction booklet and the review card.",
    "title": "Great sound and great value!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 15, 2018",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought cable January 29, 2023. The wire going into plug is how exposed. So not last long on daily use.",
    "title": "Wire exposed after a few months of use",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 26, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works as advertised",
    "title": "Works and is cheap",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 31, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good quality",
    "title": "Works great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 6, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use this in my car with my phone.  Works well.",
    "title": "Works",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 2, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "works really well. More versatile than standard USB-C cables as these can be plugged into the more common USB \"A\" found on computers and most phone chargers.  This eliminates the need for me to carry a separate USB-C charger when travelling.NOTE that it will not charge as quickly as a standard USB-C charger with a USB-C cable, but charges quickly enough.Using the \"AMPERE\" phone app, the attached pics show that the AMPERE app measuring the charging of an ALMOST fully charged LG Nexus 5X phone charging at the max rate of 400 mAh with the LG Charger and OEM LG USB-C cable.The other picture showing the max charging rate of 340 mAh is with the Amazon USB-A=> USB-C and a OLYTEK travel charging using the standard USB-A outlet.  So, the AMAZON cable is charging about 85% as quickly as the OEM LG USB-c charger and cable.NOTE 2= when a phone is mostly charged, the charging rate slows down.  If the phone's battery was used up the rates would be much higher.Seems to be of very high quality and the white cables make them easy to locate in a bag.",
    "title": "Works well, well made; charges quickly",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 7, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Love the length?",
    "title": "Faster charging!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 27, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Seemed fine then fairly quickly lost charging ability.",
    "title": "Lasted 6 months",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 10, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I recently upgraded my cell phone and of course the new phone had a newer USB C connection instead of the micro USB that all my existing cords use. The New phone only came with a single, three foot cord and that's essentially useless. I bought two of these so I can charge my phone by the bed and in the living room if needed and put the original cord on the car charger.The six feet in length here is very handy. I have one plugged into the USB outlet on a power strip and the other through the regular outlet connection. Both work fine with my Sony Xperia XA2 Ultra phone. There's no heat and the cables fit my phone. It charges quickly enough for my needs - the phone has an enormous battery, so I typically only charge overnight or in the car.",
    "title": "Working as they should with a new Sony Xperia XA2 Ultra phone",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 7, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Durable",
    "title": "Useful good,  durable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 6, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought this to use in the hospital when I have birth. The cord length was amazing to have. I used it for about 3 months and now it doesn't always charge. It'll connect and disconnect every few seconds.If you are buying for a specific time and place, as an extra it's worth it. If you intend for this to be your main charger, it probably won't last too long.",
    "title": "Works. Great for a few months",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 26, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I had this Amazon Basics usb-C cable for about a month and I'm very impressed with it's durability. I accidentally lost it in a parking lot for 6 days and found it. The outer housing was scratched, dented and dirty but after cleaning, the cable was still works even after 2 days of rain. This cable is high quality and a worthy replacement cable for phone and tablet.",
    "title": "Works great and tough like a Nokia phone",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 6, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Price was a Steal,lol!",
    "title": "Length is Great!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 20, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "WARNING: Check your power brick, the cable doesn't charge fast in an older one with low voltage... but neither does any other cable. I mistakenly gave this product a 1-star review because my other charging spot is using an ancient and slow power connector.This USB C cable charges fairly fast, maybe not as fast as the one that will come with your newest smartphone but it does support fast charging. I've had it for more than a year, but haven't used it often due to its location in a secondary spot and my mistaken belief that it was slow. But this is a good cable.If it comes to Anker or other far more reputable cable companies over AmazonBasic at the same price point, I'd go with those other companies, but if you're seeing this for like $5 this is a great cable to get.",
    "title": "Good, Not Perfect.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 1, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The wire on these is thinner than my other USB c charging cables, and it seems to want to hold the kinks from its packaging. I like my cables to be smooth and supple and not have Benz in them. I haven't used it long enough to rate the durability for sturdiness but I'll give them four stars out of Grace. And I've only use them to charge 1 or 2 amp 5 volt devices which they seem to do fine so I don't really know how good the charging power rating is. My higher power chargers have USB c at both ends, I got this to use with my 5 volt 2 amp chargers that are USB a to c, like the ones that I installed in my camper.",
    "title": "Ok, cheap, not that great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 20, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "UPDATE: The device charges fine directly on the computer or a regular USB power hook-up. Still can't speak about durability, but compared to another Apple brand cable, it's thicker, so amending my review to 5 stars.The cable is a good value, since Apple doesn't have a store brand for this and if they did it would likely cost 5 times as much. It does what I needed it to do, which is transfer data to and from my older iMac. I will eventually test/troubleshoot the charging function and if I can get that to work, I'll update my review. I haven't had it long enough to comment on durability or sturdiness, but both seem fine, so I give 3 stars for starters.",
    "title": "Good value.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on September 21, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Unable to use as a data cable.  Connected my Android phone to my pc using this cable.  PC doesnt recognize the phone.  Tried a different cable, and the PC was able to recognize it.",
    "title": "Unable to use as a data cable.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 9, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good charger! Shipped fast",
    "title": "Will not work for MacBook Air w/ out another male c charging block as usb doesn’t have enough power",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 13, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I had high hopes for this. At first it was great, charged fast, really all you can ask for in a charging cable.But I've only had it a month and a half and it's coming apart already! It's not like I'm tugging and pulling on it, it just lays on my bed and I plug my phone in at night.  It's been like this for two weeks now. Only a matter of time before the wires short out and stops working.",
    "title": "Wouldn't Buy Again",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 21, 2022",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I'm using this as a cable for a controller so I can't say how the charging is, but it is pretty stiff and a bit weird to use for my controller.  It gets the job done though and have had no other issues yet.",
    "title": "Pretty stiff",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 24, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I probably own more than my fair share of devices that use USB cables, and I've either lost or broken a number of cables over the years.  Cheap USB cables are available everywhere, of course, but cables that last can be harder to find.  This cable, which I bought to charge my new smartphone in my car, is The Good Stuff at a better-than-average price.  Let me tell you, it's gone through a lot in the months that I've been using it -- getting jerked out of USB sockets, stepped on, pulled out from under whatever I toss into the passenger seat, etc. -- and it keeps on working well.I don't know who makes Amazon Basics cables, but I have yet to have an Amazon Basics cable break or fail in over two years of using this brand.  I trust them enough that I've since begun buying other Amazon Basics products, including two camera bags for my growing DSLR-photography hobby.",
    "title": "Good price, good quality",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 3, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cable is well made and nicely finished.  I have only used it for data transfer and not charging, but appears to work quite nicely in regards to the former. My only complaint might be that the cord will not \"hang\" due to the rigidity of the sheath.  Something more flexible would be nice to have to help prevent snagging on \"stuff\" particularly if used in the car.",
    "title": "Decent value, though the sheathing is a little stiff",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 1, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought some other packs of USB-C cables.  Some of them slow-charged my hero batteries in the external charger, but had problems with all of them trying to get them to data transfer from the camera to the PC.  This one works great.  Plugged it in to the PC with the camera attached and immediately began charging.  Turned the camera on, device was found and transferred data seamlessly.  Pumped it works well, a little sad it took me this long to go with an Amazon Basics product because I already own so many of them.",
    "title": "Charges & Data Transfers my GoPro Hero Black 7!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 6, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "You get what you pay for. It charges. Just slow.",
    "title": "Charges slow",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 26, 2022",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The side port on the iPad Pro Magic Keyboard is for charging only.  If you wish to sync with iTunes, you must remove your iPad from the Keyboard and plug this cable directly into the iPad.  (Also note that the side port on the iPad Pro itself seems to be disabled when it is attached to the keyboard.)  The USB-A ports on my Windows PC do not appear to supply sufficient power to charge the iPad when using this cord, most likely a limitation of my motherboard and the older lower-power USB ports that were \"state-of-the-art\" not that long ago.  (iPad reports \"Not Charging\".)",
    "title": "If you have a Magic Keyboard",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 14, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works and fits perfectly! Left for vacation and realized just before getting on plane, I’d forgotten my kindle cord😳. I immediately looked on Amazon, found what I needed and ordered to be delivered to my destination address. I received my shipment the next afternoon!! Great service Amazon!! You don’t disappoint!!",
    "title": "Works great!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 10, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The charging cable that comes with new cell phones does not allow photo transfer. When I discovered this I was told that I needed a data cable, so bought this one. It works perfectly for transferring copies of my photos from my cell phone to my laptop computer. Unfortunately, I still can't transfer them from computer to cell phone, and I've been told that it's necessary to use the \"cloud\" to be able to do this. At least I'm half way there. I like the phone connector design too. It doesn't care if it's plugged in upside down or up. It works either way. I have wireless chargers, so don't use the cable or port for charging.",
    "title": "I can finally transfer my cell phone photos to my computer",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 3, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have had these cables before, and I do like the Amazon Basics line of goods in general.These are hearty in the way they are made, and last a lot longer than any other cords I've owned.However, the one draw back is their rigidity, they don't bend or flex easily. If you hold your phone while its plugged in, it will continually drop the cable on you. The rigidity doesn't allow the cable to bend as you move, and forces the connector to flex back and forth making it wiggle out of the port.I have one of these in my car, wired into the dash and comes out at the phone mount. The setup is static and the wire doesn't wiggle free. So, for that setup its perfect.  But I have another loose wire in the cab for the passenger, and you have to hold the cable to keep it from coming out.I also use another for connecting a laptop to my network. Its fine because it doesn't move and wiggle out.",
    "title": "Great longevity, but a little too rigid for hand holding.",
    "location_and_date": "Reviewed in the United States on September 13, 2020",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The Amazon Kindle comes with a short recharge cord. If you like to read in bed, this is too short for most rooms. Thus we had to go looking for a new cord. But Kindle changed the socket on the Fire Version 10 to the USB A-2.0 which is so much better since one can insert it either way (i.e. upside down) which is not possible on the older Kindle devices/cords which were not symmetrical. This cord has the length one needs and is perfect for recharging the newer Kindle Fire devices.",
    "title": "NINE FOOT KINDLE CORD VERY USEFUL",
    "location_and_date": "Reviewed in the United States on April 17, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have 2 kids and we each have at least 2 apple products that use these cables so my kids loose cables often. These cables have worked well and they get lots of use.  I've had no problem.  I've used them plugged into the wall, in my car to connect to apple carplay, plugged into a computer and into the cigarette lighter and they have worked in each of them! no complaints here.",
    "title": "So far so good",
    "location_and_date": "Reviewed in the United States on August 9, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Not the best of the Amazonbasics cables i've used.  Bought it as a secondary cable for use in my car.  Whenever I plug it into my cell phone (ZTE MAX) the phone continually \"dings\" on and off because the cable is very loose in the USB C port.  The OEM cable does not cause this to happen, neither does the OEM cable from a Samsung phone I have.I  have several of this brand of charger cable for my Apple products, both with the 30 pin connector and the lightning connector, and always recommend them over any other brand including Apple's branded cables, as these have worked just as good for a fraction of the price, and honestly, have lasted longer than the Apple OEM ones. Which makes me think that this is just an isolated issue.I did not return it because if I use it as a desktop charger, where it's not moving in the vehicle, it does not chime on and off all to often.  I assuming that its because it's stationary and the plug is not wiggling around.I would still recommend buying Amazonbasics cables over the OEM for any manufacturer, and especially over the 100's of non OEM brands from any retailer, as they not only cost more, but in my experciance are subpar, and not orth buying even at 1/2 the cost of the Amazon basics.",
    "title": "Generally a good product,",
    "location_and_date": "Reviewed in the United States on April 4, 2018",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I wanted it to be a charger for my computer and didn’t work so I don’t know if it was the right thing or something",
    "title": "It didn’t work for me",
    "location_and_date": "Reviewed in the United States on March 1, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Didn't want to purchase a different Samsung car charger when I have a perfectly working usb car charger I bought from Target. I needed this for wgen I'm in a bind and unable go charge at home. Love the quick shipping and the current durability. If it ever frays I'll protect it beforehand with a GLOW cell phone cable from the cable - bite website! Love there cute protectors 😇.",
    "title": "The handy charger with a reasonable average length!",
    "location_and_date": "Reviewed in the United States on September 2, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "These stopped working within two weeks. I have ordered before without a problem, However this time was different.",
    "title": "Stopped working",
    "location_and_date": "Reviewed in the United States on March 9, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This prove to be useless for me. It kept disconnecting. Other cables worked.",
    "title": "Cable kept disconnecting from phone",
    "location_and_date": "Reviewed in the United States on March 20, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought this with the hopes of it being compatible with my Google Pixel 3 phone.  I've had problems with other cables not properly fitting in the USB C port on my Pixel 3.  (The metal shrouds are too thick so it won't stay connected)  Thankfully this fit in the port perfectly and charges without any problems.  I'll probably buy a 2nd cable now that I know that it fits.",
    "title": "Works fine and fits in me Pixel 3 without any trouble.",
    "location_and_date": "Reviewed in the United States on June 18, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed a longer charging cord so I purchased the black one. It takes my phone a little less than an hour to go from 0%-100%. Both ends were sturdy and hasn't shown signs of wear/damage, even after dropping my phone a few times while connected. I haven't connected it to a computer so I cannot rate the transfer speed but it works perfectly well as a charging cord itself. I had it for over a year and a half until I needed a new one. The only reason I purchased a new one is because my pup chewed up the last one I ordered.Good enough for me to order twice.",
    "title": "Good for charging a Samsung phone",
    "location_and_date": "Reviewed in the United States on July 9, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I was looking for a high-quality extra long USB to fit my Bose headphones so I could charge them where I use them - not inside their case or a foot away from my charging station. These are perfect! Thank you!",
    "title": "Perfect length!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 14, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I ordered this cable because I wanted something longer to charge my devices at my nightstand. While this is longer than the cable that I have, the charging power is probably half of my Apple cord. It takes overnight to charge my iPad and sometimes doesn't even keep up the charge when I'm using the device! It's ok if you're just looking for something that will charge overnight but it's not a fast charger.",
    "title": "Long cable but slow charge",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 8, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I am new to USB C connectors. Hope they are more sturdy than the micro USB.  At least there is no upside down. That will help with not having to look at the connection while plugging it in.",
    "title": "New standard.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 17, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Too soon to give them a 5-Star...and even a 4 seems premature, but at this time, they function well; and price point good.",
    "title": "Functional.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 8, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is not a fast charging cable, so while it's an economical option for its length, you'll have to wait longer for it to charge your device.",
    "title": "Bought for specific purpose, but charges slowly.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 8, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Got this cord as I have not been disappointed by Amazon basics before. This cord worked for the first few times it was needed. After a month or so it only charges if you keep it at a certain angle. Will be buying a big brand name one next time. Not worth it for a single month of use.",
    "title": "Worked for a few charges then quit",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 13, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Im using an ANKER power station with this cord and it charges so slow, it definitely doesn't support fast charging. I have an ipad pro 12inch",
    "title": "No Fast Charging",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 8, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I've had this three weeks now and everything seems to be working nicely. I like the price on the nine feet since most chargers will cost 13 bucks already. I'll edit this if anything goes wrong but for now, it's been great to use. Edit: I've had this for 2 months and the charger has broke. I have to adjust it to make it work and if you do buy this, maybe dont twist it much and be careful with it.😐",
    "title": "Worked nicely",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 14, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Imagine, for a moment, if you will, that the power running through your usb cable is made up entirely out of ferrets, instead of electrons. Wouldn't that be something?As it stands, there's only a bunch of electrons running up and down those little lines of copper. HOW BORING! I WISH IT WERE ONLY LITTLE, GLOWING FERRETS RUNNING THROUGH THOSE DARN TUUUUBBBBEEEESSSS!!!!!So why can't I? In the realm of imagination, see those imperceptible blobs of energy in the shape of those good, good tube weasels. What if: I'm right? What they do look like little lighting ferrets? THEN WHO WOULD BE THE FOOL AND WHO THE MASTER!!!!!Good charging time and well built. Four stars.",
    "title": "It's like a tube for electron ferrets",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 26, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed to charge my ipad via my Dell laptop through the USB and thought this would work on my Ipad Air 5th Gen.  It does not work - when plugged in, the ipad states in the upper right corner \"Not Charging\" -so it recognizes that the cord is plugged in but for some reason will not charge.  The cord is useless to me if it doesn't do what I intended.",
    "title": "Does not work to charge Ipad Air 5th Gen",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 23, 2022",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It did not work for me well. Charging times are very long. I used the 3a adapter and very charging.",
    "title": "Not good for fast charging",
    "location_and_date": "Reviewed in the United States on February 17, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "For some reason, the USB-C end of the cable doesn't fit well in my phone or other devices. The connector seems to be too short or the internal wires not positioned correctly, resulting in charging only happening when I hold the cable tightly with a slight bent angle. As soon as I let go it stops charging. It was this way from the very first day of use. I finally bought a replacement of the same type of cable from Best Buy and it works perfectly. Sorry, but this cable is too cheap and does not work.",
    "title": "Poor connection",
    "location_and_date": "Reviewed in the United States on March 30, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "After misplacing the charger that came with my speaker, I did not think it would be hard to find a replacement, however, if you look at the reviews of so many of these USB's, too often people get them only to find they don't work with the product as they claim.  Well, this one worked and is actually longer than the charger that originally came with my speaker (bonus).  Not sure about durability as we just received it, but I'll update the review if it doesn't hold up to normal wear and tear.",
    "title": "Works for Sony SRS-XB23",
    "location_and_date": "Reviewed in the United States on August 18, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "First, I want to say that the only thing that I charge with this cable is my Sony wireless headset; so take this review with a grain of salt.This is probably my 4th or 5th AmazonBasics cable in my 'collection' and so far, this is living up for what I need it for as well as the others. Granted, by the looks of it, I question the higher wattage charging capacity of this cable, but it is made to a higher standard than the crap 6\" charging cable that Sony added with my headphones.",
    "title": "Works great for charging my headphones",
    "location_and_date": "Reviewed in the United States on December 2, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It's a standard USB-C cable. So long as you have an adaptive or fast-charging charger, this cable will get the job done. Although I do certainly use my fast charger, I find the charge time is comparable if I put it straight into a USB port on an outlet (like you would find on a desk or wall). Although to be honest, I'm not counting down the time. I do however work in IT so I would have a complaint or two if it didn't work the way it was intended to work.I get annoyed to go into any retail store and find that USB cables are anywhere from $15-20, USB-C or not. So I'm pretty grateful that at least someone can make these cables for a reasonable price.",
    "title": "It's a USB-C Charger.",
    "location_and_date": "Reviewed in the United States on May 22, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought it for a while to evaluate it. I didn’t expect to buy such a good item at such a cheap price. The charging speed is very fast and it is convenient to carry. I feel that it is excellent value for money. The only drawback is that the color is not what I like.",
    "title": "Very nice stuff",
    "location_and_date": "Reviewed in the United States on December 30, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "As far as a regular USB charging cord for my phone it worked well. The issue was I really bought it to connect my 2019 Dodge to my Motox4 phone to operate Android Auto. The cord did not work for this purpose. The phone connected and charged but would \"disconnect\" in five minutes or so and not reconnect on its own. I had to unplug the cord, plug it in and unlock the phone to get Android Auto to start again. Then in five minutes it would disconnect again. I bought an Anker model A8168 and it works perfectly.",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on October 11, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I had several cables for my previous phones, but when I got my new S8, I realized I had no cables that would fit with it. I was relying solely on the charger that came with it. So after a while I went to Amazon to find cables. I was glad to see these Amazon Basic USB C cables and went ahead and purchased two of them. So far so good. I have one plugged into my computer and keep the other at work. I got similar estimated charge times from these and the original charger. I plugged the USB end into the old AC adapters I had from my previous chargers and it works just fine.If I ever need another one I'll have no issues ordering another one of these.",
    "title": "Always nice to have extra cables",
    "location_and_date": "Reviewed in the United States on October 11, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use to go through so many cords until I found these. I have one that the cover has ripped off at the connecter expising the wires and ut still fast charges the phone.",
    "title": "Great Charging Cord",
    "location_and_date": "Reviewed in the United States on March 4, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Purchase these cables for my iPhone 13. The lightning connector end fit very loose doesn’t make good contact with the phone, have to wiggle it side to side to get it to work",
    "title": "Not worth it",
    "location_and_date": "Reviewed in the United States on January 6, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have a device that measures amperage through USB charging cords, and these Amazon Basics cords consistently show higher amperage being sent to my phone, which translates to more energy reaching the device and faster charging.  Great performance and great value.",
    "title": "These Amazon basics cords are fantastic.",
    "location_and_date": "Reviewed in the United States on January 8, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought a cord and I could here the electricity shortage immediately. I was sent a 2nd and it worked ok for a couple weeks and then did the same. Might be Amazon's choice but its not my choice. Returned both because I don't want them in my home.",
    "title": "No Thanks",
    "location_and_date": "Reviewed in the United States on May 18, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "To short, quality not very good",
    "title": "Worth half as much",
    "location_and_date": "Reviewed in the United States on March 10, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I've been trying to connect my Pixel 3 with the Android Auto in my car with no success. After trying all my existing cables, I read the reviews and most people were successful when using this cable with a Pixel phone. It also worked for me!  The USB A connection is 2.0 so it won't fast charge but this is all about data and the cable does this very well both in the car and with a PC data transfers. I also like that the cable is thinner and more flexible than a braided cable and is easy to fold it around to fit in the small area that holds the phone. I am very pleased and would purchase this again.",
    "title": "Works Well with Pixel 3 and USB Car Connection",
    "location_and_date": "Reviewed in the United States on June 19, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "seriously i kept spending TWICE as much sometimes even more than twice as much at the stores!! was buying the so called \"heavy duty\" cables that are suppose to last forever. they never would last 3 months. i have been buying amazon basic charges now for everything!!! its cheap and amazing quality. best part?? YES THEY SUPPORT RAPID/FAST CHARGING.... some of the cords that cost twice as much don't even support that",
    "title": "amazing amazing amazing!!!",
    "location_and_date": "Reviewed in the United States on December 25, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I ordered this after learning that I needed an A to C connector to sync my cell phone with my car, and this one fit the need perfectly.",
    "title": "Great connector",
    "location_and_date": "Reviewed in the United States on March 15, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "In some cases, if you need to recover a MacOS disk, you may need to do that by using another Mac to reinstall everything.  This is especially true for the new M1 silicon Macs.  I needed to recover a non-responsive Mac mini, and this cable is used to hook the computers together.  Worked like a charm.  Thanks Amazon.",
    "title": "Every Apple computer user should have one",
    "location_and_date": "Reviewed in the United States on April 17, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This product was exactly what I was looking for. My cell phone came with a measly 3 foot charger cable to connect the charger to the phone, and I wanted something with a little more length so I could have a little more flexibility to use the phone while it was charging. This cable was perfect in that it has good length, and was compatible with my charger (and Turbo Power), so was exactly what I was hoping for. Very happy with purchase.",
    "title": "Sturdy, functional USB extension cable",
    "location_and_date": "Reviewed in the United States on August 28, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good quality cord",
    "title": "Works as it should",
    "location_and_date": "Reviewed in the United States on December 29, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cable was priced right, and it works as it's supposed to. I like having white cables because I can find them easier in low light. A good value!",
    "title": "What I needed",
    "location_and_date": "Reviewed in the United States on February 24, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This cable is fantastic and I was compelled to write a review. Great build quality and looks for the price. But move importantly, seems to be made of really good conducting material as my Google Pixel phone is getting charged crazy fast from my car charger using this cable - much faster than with even Pixel's own charger (using the cable that came with the Pixel)! I could not believe it. The car charger is one I bought back in 2015 and with the previous cable (also bought from Amazon but a different brand) it took way longer to charge. Just changing to this cable is making a big difference.",
    "title": "Fantastic!",
    "location_and_date": "Reviewed in the United States on November 2, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works just like the real deal",
    "title": "Perfect fit",
    "location_and_date": "Reviewed in the United States on December 8, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It is ideal for charging my beats earphones. It’s terrible that Beats includes a Useless Charging cord and to use them you have to order this cord separately. What a Scam!",
    "title": "Excellent at what it does!",
    "location_and_date": "Reviewed in the United States on February 12, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I went through two other sets of cables advertised as supporting the Galaxy S8 line before finding a 6ft cable that actually fast-charged my phone.My only complaint with the cable (and the reason for 4-stars instead of 5) is that the large female-side of the USB doesn't fit very snugly in either my computer's USB port or my AC adapter. It seems just a touch too small. Not a huge deal, but I did accidentally disconnect the cable from the AC adapter during the night leaving me with a less than 100% charge in the morning.",
    "title": "Great length and works with fast charging the Galaxy S8",
    "location_and_date": "Reviewed in the United States on January 24, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Theses charging cables from Amazon Basics are consistent and reliable. The package of five was very convenient - it is difficult to find a better deal for long charging cables. Each cable is neatly wrapped, and it's easy to use the cable ties to only release the amount of cable needed.",
    "title": "consistent and reliable",
    "location_and_date": "Reviewed in the United States on July 14, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Totally melted. Amazon states that it may be replaceable for up to one year, but offers no way for that to happen after the 30-day refund period has ended. Did work great and had a quick charge for months before it melted.Update: After having to Google how to reach Amazon Customer Service (eye roll), they responded quickly and replaced my charger very quickly at no cost. Still concerned that the first one melted, but aside from that, it is a very fast and reliable product.",
    "title": "Great charger, but did melt",
    "location_and_date": "Reviewed in the United States on October 2, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "We have a charging pad for our phones but the plug for where we want it is longer than the cable that came with it.  This 6-foot cable does the trick.  The USB-C plugs into the charging pad while the USB-A plugs into an AC adapter and into the outlet.  No compatibility issues and the charging pad works as expected.  This extra length cable was just what I needed.",
    "title": "Great option to give you more cable length",
    "location_and_date": "Reviewed in the United States on October 19, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Got this cable in all 3 sizes.  My existing cables were all giving me \"Incomplete connection\" errors on all my devices.  I tried a few other cables that were highly rated and came in two-packs for less money first.  Same issue.  So I figured that I'd give these a shot.  Worst case, they didn't work either and I return them.After a few weeks of using nothing but these cables, I have had 0 issues.  The fit is better than the cables that came with my devices, and works great with my fast chargers.  Considering the price difference between these and the 2-packs I'd normally knock off a star, but the quality more than makes up for it.",
    "title": "Worst case, they didn't work either and I return ...",
    "location_and_date": "Reviewed in the United States on January 26, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Have had repeated problems with the \"C\" connection on my NOKIA MOBILE PHONE. Have purchased a number of relatively expensive charging cords but most have failed. \"Who'd have thunk it?\" The AMAZON BASICS USB TO C CABLE connects every time and after a few months of daily use, is as sturdy as the day it arrived.My mistake for believing AMAZON BASICS brand is cheap, generic equivalent. Will see it in a whole new light!",
    "title": "STURDY C-TYPE CABLE RELIABLY CONNECTS",
    "location_and_date": "Reviewed in the United States on August 12, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The USB C cable arrived quickly.  The cell phone said that the computer and USB ports on the powerstrip were making it charge slowly.  I used the USB port that came with the phone and it seemed to charge faster.  So, I'm not completely sure if this does or does not charge quickly.  However, it is 6 feet long and it does seem to work, so long as it is in a quick-charging port.  Not sure what that means when it comes to a review for the cord itself, but it seems to work.",
    "title": "Seems durable and arrives quickly",
    "location_and_date": "Reviewed in the United States on October 23, 2018",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Always been the best investment a Amazon charger.",
    "title": "Trusty",
    "location_and_date": "Reviewed in the United States on November 23, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I've said it before in reviews in the past, AmazonBasics cables are the only way to go. There are some cheaper options, but it's not worth the savings because they break or don't work well. Period.",
    "title": "Best cables out there",
    "location_and_date": "Reviewed in the United States on December 20, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "You often do not think of such little things as phone charging cables. But if you take just a moment, you will realize how important it is to have a good one. These are relatively cheap compared for other cords. I keep one in my backpack, one at my desk, one in my suitcase, and one by my bed. They are strong and do not degrade quickly. I would highly recommend these for anyone who lives a highly mobile life. They coil up well, but the insulation is thick and malleable enough that it does not crack easily. I like this product, it has served me well.",
    "title": "Great bargain",
    "location_and_date": "Reviewed in the United States on July 31, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I mean, it works at least.",
    "title": "Eh...",
    "location_and_date": "Reviewed in the United States on November 13, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Now that most android phone have switched over to USB-C charging cables, all my old chargers wont work with my new Samsung Galaxy S20. I am one to like to have multiple chargers handy, so I purchased these new charging cords. I have never been disappointed with \"Amazon Basics\" choices. They are very affordable and of comparable quality to the more expensive similar products. I am very happy to have these extra charging cords around the house and for taking trips.",
    "title": "Good for the price",
    "location_and_date": "Reviewed in the United States on June 6, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It looks nice but it is not going to last long",
    "title": "It slips out of the port over bumps",
    "location_and_date": "Reviewed in the United States on October 23, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Every time I connect it to my 2011 IMac desktop for screen sharing on zoom with my iPad 4 generation! ,  it makes a deep humming sound every 20 sec or so!  Don’t know why it does that?  I tried to figure out why? Can’t resolve the problem!  Maybe because it’s not an Apple Product?  Not sure?  It works but can’t get rid of that annoying sound!!!!",
    "title": "Works but Annoying Sound!",
    "location_and_date": "Reviewed in the United States on October 15, 2021",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The actual wire isn't as robust or as flexible as I thought it would be, hence 4 stars instead of 5.",
    "title": "You get what you pay for",
    "location_and_date": "Reviewed in the United States on July 11, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It might seem silly that I'm gushing over a USB C cell phone cable, but this cable works as good as the name brand cable that came with my Galaxy S8 for a fraction of the cost. I bought it as a spare, but use it as the primary now. It's twice as long as what came with the phone, and more durable. I treat myself when it comes to certain items, and I try not to skimp when there's an apparent quality difference, but this is one of those AmazonBasics items that isn't a cheap knock off. I highly recommend this cable, and have bought other AmazonBasics cell phone cables in the past.",
    "title": "Cost effective, durable, and otherwise impressive",
    "location_and_date": "Reviewed in the United States on November 24, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use it to connect my Oculus Quest to a power pack when the built-in battery is low.",
    "title": "Works as it's supposed to.  Seems to be good quality.",
    "location_and_date": "Reviewed in the United States on March 13, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "My wife and I were having issues in our car (2016 Civic) where Android Auto would occasionally disconnect. I tried different cables from Anker, the cable that came with the phones and other brands. They all seem to have the issue to one degree or another. We assumed it was the car's radio having the problem, but every time I looked it up online all I could find was cables being the issue. Finally tried this one on the recommendation of some forum I was reading and it works perfectly. Haven't had a disconnect since we got it and it's been over 6 months.",
    "title": "Only one that works with Android Auto well for me",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 14, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I purchased this one for my Motorola phone and it wasnt working properly. SO I called support and they suggested I purchase the Motorola charging kit and it worked great.......I wouldnt recommend this one if you have Motorola phones......other phones I am sure it will be fine.",
    "title": "Not good for all phones",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 14, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I jumped on here to buy more of these cords. This cord has lasted longer than others I have bought. I obviously would recommend a purchase. It charges my devices fast and I am just happy it has lasted as long as it has, and is still going strong.",
    "title": "Has lasted longer than other's I have bought!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 6, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is working just fine as my travel cord coupled to an Anker USB charging station. It charges quickly and is holding up well to getting stuffed in a backpack and pulled out regularly. Great value as well.",
    "title": "Great Value",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 2, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Simple and it worked. I have to do a restore on my iPad Pro but needed to it with my older iMac. I had a usba to usbc issue and this cable worked elegantly.",
    "title": "Needed a cable for my iPad Pro",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 4, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Comes in a tiny box, very well packed. The delivery was handled very well! The cable in itself is exactly what you expect, it's not gonna be super fast. It charges slowly. But the material is sturdy and 6 feet is accurate. The first time I plugged it in, it took like 5 seconds for the phone to start charging, I'm unaware as to why, but still!I am buying this only as a spare cable, so it serves the purpose for that!",
    "title": "Good product for a spare cable, sturdy. You get what you pay!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 11, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "They work for a few seconds then turn all the way down.  I can't turn them up or down on the cord and people say I'm muffled when on the phone with them.  All 3 pair are like this.  Unfortunately I didn't know because I got them for skiing and didn't try them out until the return date was over.  I wouldn't buy these.  I would be happy to change my review if they sent me some that work.",
    "title": "They don't work.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 4, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I ordered the six feet string. The wire and rubber casing on this is durable. The USB-C side is high quality and isn't flimsy. I can miss and jab the charger hole a few times without worrying about it breaking on me. My bunnies bit parts of the string here and there (they only got through the rubber part before stoppimg). I can see the wires inside but it did no real damage. I also find the rubber casing to be quite thin and that the metal wires contributed the most to the thickness of the string. I will definitely buy this again, one shorter so that it's more convenient to carry around",
    "title": "Durable.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 9, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This has been the most durable cord I've bought yet.  Even searching intently for the highest rated cords didn't change them breaking in 2 months or less.  I've gone through 6 cords for my micro usb while this type c is still going strong.",
    "title": "Most durable cord I've ever bought.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 1, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "product delivered on time, works as advertised.Good price, too!I got this to connect a powered USB-3 hub to the controller card that I had installed in my 10-year old desktop.  So far, I am pleased.",
    "title": "Good price for a USB 3 cable that works.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on September 20, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Ordered this cable because we seem to misplace our USB-C cables and we only had a few.  I do have some of those little converters you plug onto the small usb to convert it to USB-C and it would charge but not transfer files.  This cable works fine to charge as well as transfer my many (many, many, many) photos from my Samsung Galaxy S8 to my computer's hard drive.I did buy a used like new from Amazon Warehouse so I paid a bit less than retail but it arrived in like new condition and it worked just fine.",
    "title": "works just fine",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 5, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I was a little worried because there were conflicting reviews about whether or not this cord worked with nintendo switches, but it works great! I got the 6 foot length so I can charge it when I’m playing in bed, so it reaches far enough when I travel with it, and so family members with usb-c charging ports on their phones can use it when they visit. It seems like good quality so far, especially for the price. I’ll update if it ever gives out or if the charging gets slow.",
    "title": "Works with my switch!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 14, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This charging cable was a good replacement for the original cable I had that broke. This cable is long (as you can see it stretched out in one of my pictures) and that makes it easy to use pretty much anywhere in a room. The cord seems thick enough that it won't break easily. When plugging it in, ut doesn't have the exact same click as the original charger for the phone, but that is not a problem and the cord works great for charging!",
    "title": "Ample length allows use anywhere!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 22, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I think the cord is fine, however I didn’t know that you needed a higher-powered wall piece to plug it in to. You can buy a similar cord at the Apple store for $20, but you also need the wall piece, which is another $70. So basically I wasted my money on this because it won’t charge my computer because it doesn’t have enough power. And seeing the price of a new charger, I figured I’d just stick with what I have, since I was just buying an extra anyways.",
    "title": "I think the cord is fine, however I didn’t know that you needed a ...",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 14, 2018",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It's charging slowly. I don't know if this is a device or this USB fault but I am not happy with the purchice.",
    "title": "Not good at all",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 22, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Even though it's USB-A to USB-C it charges my Google Pixel 3a only about 25% slower than the USB C- USB C charger the phone comes with, which I wasn't expecting. It's also really long so it's super convenient to keep it plugged in while walking around the room. I'd go for an even longer cable if I were on the market again. Been using this cable for a long while, no complaints. Go AmazonBasics!",
    "title": "Fast Charging!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 4, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have tried multiple usb c chargers that didn't work. This one does. Funny that something that does what it it supposed to do gets five stars but that's the world we live in now.",
    "title": "Works Great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 23, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I just purchased an iPad Pro 11 and needed a six foot inexpensive cable to charge it from my existing multi-output USB-A charger since the cable that comes with this iPad is a USB-C to USB-C. It works fine for charging.  I have not tried it for data transfer.  I will use a shorter USB-C to USB-A 3.0 for transferring data due to the speed of USB 3.0.  The cable is very stiff but for my use this is fine.",
    "title": "Cable is OK for My Use",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 15, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Had to order this with next day shipping because mine broke and i use my phone for work. I thank the packing staff and delivery driver who got it to my house by noon the next day, and apologize sincerely for the extra stress. I try to never do this unless it's an emergency! Otherwise, it was well packaged, arrived faster than the wind, and seems to be doing a great job thus far!",
    "title": "Looks sturdy, good length, fast charge",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 17, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I watched the delivery driver throw my package like a frisbee from the side walk onto my concrete doorstep.  It's a cable and it works, so no harm done, this time.  Is it safe to order fragile products from Amazon?",
    "title": "Works after being thrown by the delivery driver.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 1, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great cable.  I don't know if it has the appropriate pull up resistor, but a 6ft version will make my phone say \"charging rapidly\".  Current draw in this state is around 2.3A, or close to the max the charger is able to provide.  My charger didn't explode, the cable didn't melt, the world didn't end.  Tried it on a Dell Latitude.  Every single USB port remained functional after I plugged it in.I've been looking for a cable like that.  If all that stands between you and laptop disaster is a miserly 56k resistor, you have a poorly designed laptop.  For those with robust chargers and USB ports, this cable's for you.",
    "title": "Benson Leung, eat your heart out",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 8, 2017",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I own a pc and electronics shop. All Ill say is better than none. Had issues with every amazon cable I've ever tried, sorry just the plain truth and I doubt they will post this review. They look wonderful but it all stops right there. I don't understand why they gave length a star rating since the customer chooses the length when they buy one, kind of a DUH! moment there....either way get something better.",
    "title": "just dont.....",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 9, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I had to throw it away because the USB C would not stay in contact with my headphones. Got a name brand cord and they work fine.",
    "title": "Not Very Good",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 22, 2022",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I’m sure it works fine but just not for me. Not compatible with iPhone 12",
    "title": "Not compatible with Apple iPhone 12",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 3, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Very useful for the purpose intended. The only thing that I thought it could have been better, is the length, as I think it's too short. Other than that, works great👍",
    "title": "Works great, but needs to be longer.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 29, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charging my Vape pen and my mom’s phone. Works great with a fast charge",
    "title": "Works great for a fast charge",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 25, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Cord is a decent length, but it keeps unplugging from my USB headset and controller.",
    "title": "Keeps unplugging from my headset.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 4, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "\"You get what you pay for\" is a saying for a reason. This is really affordable, and the USB-A/USB-C cables I received with my Android devices are ABSURDLY short, so the long cord was something I desperately wanted to find. But a few weeks ago, a little under a year after I bought it, this cord stopped being effective at charging, and my devices almost always either 1) don't think they're plugged in, or 2) warn me that they are charging much slower than they should be -- and that warning generally means that they are charging so slowly that they are draining the battery faster than they are charging it, so the phone will inevitably die. I have to contort the phone so that the USB-C is at a slight angle to get it to charge at all. Meanwhile, the absurdly short cords still work fine, so I know it's this cord and not my devices.It's not a bad price, and maybe other cords would also fail after about a year. But I was disappointed and won't be buying this again anytime soon.",
    "title": "Worked for a year",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 13, 2020",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This cord will transfer data from my VR headset to my computer, and charge the headset at the same time. The 6-ft length is a real plus, because I can use my headset to watch movies while it's plugged in.",
    "title": "Just what I needed",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought this to connect my iPad Pro so my older MacBook Pro. Just wanted the essential cable in case I ever needed it for something. I've bought previous Amazon Basic items in the past and this one works just as well. Not really sure if I'll use it for downloading/uploading info between the two, but the charging works albeit slower than the normal cable from apple. But it'll do. Always safe to have.",
    "title": "The Essential",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 7, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Right length for those that need to charge while using because you get 3m of cable and you don't need to bend or do acrobatic moves in order to still be plugged into power. As for durability, only time will tell.",
    "title": "Does its job well",
    "location_and_date": "Reviewed in the United States on July 9, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought this cable specifically for use with the Nintendo Switch. When I first tested it, I was able to get the 'charging' icon to show up on the Switch, but it would go away, come back, go away, come back over and over and wouldn't actually charge (keeping the screen on, thus draining the battery instead of charging it). I thought it was the cable itself, so I had a new one sent out, but this new one is doing the same thing. I've tested with 5 different AC adapters, 3 different computers' USB ports (around 8 total USB ports) but haven't been able to get it to work. Also, I'm using it plugged directly to the Switch, not through the dock. I don't want to give this a bad review, since I haven't tested the cable with anything else, but it didn't work with the Nintendo Switch for me at least.",
    "title": "Didn't work directly with Nintendo Switch",
    "location_and_date": "Reviewed in the United States on January 17, 2018",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought in July 2019. Lasted about a year but never did write a review.  Had my phone charging on the arm of the couch and smelled something burning.  Looked at my phone and it was extremely hot and noticed the plug was melting.  It scorched the charging port of my phone.  Luckily I caught it before it caught on fire!!! I see many having the same issue so this is a good chance it'll happen to you or happen again so not sure why they're still selling these.  It does not look like it's a one-off issue. I already threw away the cable but pics of my phone at the time.",
    "title": "Melted, almost caught fire",
    "location_and_date": "Reviewed in the United States on November 23, 2022",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Needed a longer cord, works well. Does not charge as fast as USB 3.0, charges slower than using factory cord/charger(pixel 2xl) the length was the more important in this case. The connectors feel solid, the cord seems flimsy especially after rolling up for storage multiple times and could be a future weak point, although cord is still going strong a few months later! So far happy with the value from Amazon basics items",
    "title": "Value",
    "location_and_date": "Reviewed in the United States on July 12, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good cables, support fast charging on my LG, even the long ones .. the very long canoe I bought was noticeably thicker than the regular and short versions.  Ends are still the same though.The outer jacket doesn't get dirty as easily as the OEM extra soft cables that everyone includes to mimic Apple white stuff. Nice.After best part of a year, they are all holding up 100%, I am not hard on cables in general though, ymmv. (I still have/use apple dock cables that are still perfect apart from the outer what jacket had completely flaked away. Lol)",
    "title": "Good cables, not cheap feeling.",
    "location_and_date": "Reviewed in the United States on September 18, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I got this as a replacement for my lost pro controller charger and it works flawlessly. It is important to note that this is a charge & sync cable. This means that in addition to being able to charge my pro controller, the cable also allows me to seamlessly interface my controller to my pc. All I have to do is plug the controller into my pc using this cable and I am able to play games like Skyrim using the comfort of my pro controller (just like with the original cable). Great value and works exactly as hoped.",
    "title": "Works Great with my Nintendo Switch Pro Controller",
    "location_and_date": "Reviewed in the United States on January 9, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Not a lot to say here, just that this is a great cable.  I needed a cable to connect my PC to my networking switch.  I connected this cable, and right away, I was up and running.  Comparable cables at Best Buy were running me $20-30, and they were taking ~10 days to get to me.  Amazon got this to me in 1 day, and I was back up and running!",
    "title": "Great cable - As always, Amazon Basics to the rescue!",
    "location_and_date": "Reviewed in the United States on April 20, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Good quality product i like the fact that 3 come in the package for a decent price.",
    "title": "There charging cords.",
    "location_and_date": "Reviewed in the United States on June 15, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Use this cable to charge my phone or tablet. Getting another one!",
    "title": "This is a nice long cable.",
    "location_and_date": "Reviewed in the United States on March 15, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "... but when I tried to use it in my friend's charging block (AC adapter) my phone thought it kept getting plugged/unplugged. It's worked fine on other blocks or directly to my PC.Much higher quality than the one I received on Christmas—which was probably the same price if not a couple bucks more.",
    "title": "Usually works well...",
    "location_and_date": "Reviewed in the United States on March 10, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is a simple purchase.  I needed the extra length and it works well.",
    "title": "it does the job.",
    "location_and_date": "Reviewed in the United States on March 2, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought it to use in our car so I would never have anon working phone. Works great. Good length on cord.",
    "title": "Great product",
    "location_and_date": "Reviewed in the United States on January 31, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I know it isn't just this brand, but more like all regular black plastic chargers. The coating has separated from the actual plug exposing the metal wires. They are becoming frayed. It still works and my phone still says fast charging, but I would have just liked to see it last longer than 4 months.",
    "title": "Don't expect this to last long",
    "location_and_date": "Reviewed in the United States on November 17, 2021",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought this charger and after exactly a week of using it, it stopped working. I tried to charge my computer for work and woke up to a dead computer and I don't have another charger. I ordered a replacement and the same exact thing happened, the charger stopped working. I’ve never had this happen before but I always buy the apple ones. Waste of money.",
    "title": "Broke after a week",
    "location_and_date": "Reviewed in the United States on March 21, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I order 2 of them and used for almost 3 months on many devices still working perfect compare to others i bought before.",
    "title": "fast charge and durable",
    "location_and_date": "Reviewed in the United States on April 4, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "We have a million of those USB A charging plugs laying around the house, and our late model cars as well as my work and home computers and most airplane charging options are all built to accommodate USB A cables. So, when Apple made the iPad Pro USB C, I knew any extra cables I got beyond the one it came with needed to be compatible with USB A. This cable works perfectly with the iPad Pro and I couldn't be happier.",
    "title": "Easily Charge the New iPad Pro You Got for Christmas Using Your Old USB A Charging Plugs",
    "location_and_date": "Reviewed in the United States on January 18, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed a cable that would charge the OnePlus 7 Pro phone for mobile use. I purchased the 3 feet version of this product which is a good length for charging the phone in the car. I tested the cable and it works great. I bought two of these so I could leave one in each car and I'm glad I did.",
    "title": "Works great in the car",
    "location_and_date": "Reviewed in the United States on September 8, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Everything about this cable is great except it's ability to withstand life. The cable itself is very thin and can't get pinched or else that's it. The cable ends get broken off the wire after a few weeks of use. It just has a 3-6 month lifespan before being replaced.",
    "title": "Great cable, just doesn't last",
    "location_and_date": "Reviewed in the United States on March 20, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works well enough.  Not as fast as an original.  Cord length is greatbb",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on February 25, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It looks OK",
    "title": "SO SO cable",
    "location_and_date": "Reviewed in the United States on October 27, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I have tried multiple cables to connect my iPad Air 4 (2020) to my HP Laptop. This is the first one that worked perfectly.  I have always bought Apple cables, but I couldn't find one like this: USB-C to USB-A.  Extremely happy with Amazon Basics and would definitely recommend.",
    "title": "Works Great With iPad Air 4 (2020)",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 29, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "What can I say, when you make a necklace out of a charging cord, this is the best.No seriously, its just a charging cord.  It is well made for the cheap price as one expects the medium quality from AmazonBasics.  I've not tried it with data.  But it might work for that too.  If it does, then, the shorter the better for transfer speeds.",
    "title": "USB-C cord where have you been all my life?",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 14, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I recently upgraded my phone and had to get new charging cables for my existing USB chargers and ports.  I bought a 5-pack to keep some in the car, at the house and in my work bag.  So far, they've been great.  No issues charging or transferring data, and it's fully compatible with my phone (Google Pixel 3).  Each end of the cable is reinforced to ward off breakage at the most likely spot.  I've only had them for a couple of months, but they have fulfilled my expectations.",
    "title": "Solid charging/data cables for on the go",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 1, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The AmazonBasics USB Type C cable is a quality cable at a great price.  With Type C taking over, and way too many \"lightning\", mini's, and other USB cables hanging out... it was time to buy a couple of these.  I use them in the car, on my desk, and on the go.  So far there are no issues, with good sturdy connections from the tip of the connector to the cable between the two terminals.  This AmazonBasics may be a basic cable, but you may find yourself coming back for more.",
    "title": "Quality and Price",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 15, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "These cables worked perfectly on our new Samsung phones. Too bad all the old cables we have are no longer used. But I like that you can plug these into the phone up or down and they still charge. They function fine for data transfers too. I love Amazon Basics products!",
    "title": "Perfect for SM-A115A phones",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 5, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cable is nice for connecting your Nintendo switch to your pc but it chargers RIDICULOUSLY SLOW! it took way way wayyyy longer to charge my switch with it compared to the normal charger. I left it charging over night and when I went to check what percent it was on in the morning it wasn’t even done charging yet. I’m kinda disappointed because I thought it would’ve been good but at least the cable works with it Switch.  Overall the cable isn’t bad for connecting to your switch but it’s awful and I mean really awful for charging.",
    "title": "Slow charger!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 15, 2020",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought this to transfer data between my Note20 and my computer. It works for that  and for recharging; the Note20 came only with a type C to type C. Yet another small USB connector.",
    "title": "Works for data transfer and charging for a Samsung Note20",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 3, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought these because the fancy looking branded ones fail too quickly. These don't look fancy but they are holding up much better so far.",
    "title": "So far so good",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 14, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great item. it does the job I need it to. Happy with my order",
    "title": "USB cord for Android phones",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 20, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works perfect. I use it to charge my phone while I use it in bed before I go to sleep. Have had it for months now and it works as you would expect. Cheap cables can have a connector that is a little stubby which results in a cable that keeps popping out of your phone. This one is the correct depth and  does not pop out.",
    "title": "Works great with my Pixel 2",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 8, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great to replace the Samsung power charger I got originally with my Galaxy S9, actually charged my phone in 2 hrs instead of 9 hrs like my last one, but even after buying 10 days ago, I seem to already have gotten a short in it already, despite taking care to not bundle this cord like the previous one but roll up everytime.",
    "title": "Great, but already electrical short",
    "location_and_date": "Reviewed in the United States 🇺🇸 on September 20, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I've found ordering these chargers from companies like this usually ensure you get a better quality that last longer, than when you run in and buy one at a chain or big box store in the same or higher price range.These last longer and the companies usually stand behind their products, so if you get one that doesn't last, I often find they'll send out a replacement. Every now and then you might get a bad one, but that rarely happens with my Amazon purchases.",
    "title": "So far it's held up well to the constant use of our teenager",
    "location_and_date": "Reviewed in the United States 🇺🇸 on September 5, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "9' length great for PS5, perfect for playing while charging.  Cable looks somewhat flimsy in online images but is actually quite thick and seems very durable in person.",
    "title": "More durable than it looks",
    "location_and_date": "Reviewed in the United States 🇺🇸 on October 3, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Love the length. Does  a great  job charging my iPad Pro",
    "title": "Thicker than expected but love the length",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 23, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I’m very pleased with this purchase. I needed A cord to convert to charge the headphones that I purchased. This works very well.",
    "title": "Met my needs very well.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 1, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Apple's device to device transfer did not work so I bought this to do the transfer data between an older iPad to an new iPad using iTunes. It worked as expected. I just used it one time so I cannot attest to the charging Power or Durability.",
    "title": "It did the Job",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 20, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The roduct is very good, according to the description and sturdy construccion. Very happy with my purchase.It connects inmediately with fast charging devices.Seller recommended.",
    "title": "Great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 9, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Being using the cable for charging and connecting USB-C devices to my computer and works as expected.  The price is excellent and delivery was fast so I'm a happy camper.",
    "title": "Good cable for a good price",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 5, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Cord quit charging after the second use. Buy yourself something better instead.",
    "title": "Low quality",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 27, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Tried for iPad Air 4, data transfer works without any issues, but the cord is not good for charging.",
    "title": "Works for iPad Air 4 for data transfer, but does not charge",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 14, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This usb cable was handy for my Galaxy Note10+ as the original cable for the phone is only usb-c which is too small for a standard USB port. I have no trouble with this product as I am finally able to use the Android Auto/Mirror link feature in my car with phone connected while on the road. Great to use!",
    "title": "👍",
    "location_and_date": "Reviewed in the United States on August 30, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I've got a bunch of old USB-A power bricks and didn't want to buy a new one. I picked up this cable and it powers my USB-C devices perfect now. Very happy with it.I only gave 4 stars because I've had a lot of Amazon Basics cables now, and they don't always last long term. This looks almost identical to those and I know it will fray in a 6-8 months.",
    "title": "Cheap way to power USB C device",
    "location_and_date": "Reviewed in the United States on November 20, 2018",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Used this for a headphone battery charger and it did the job!",
    "title": "They Worked Fine",
    "location_and_date": "Reviewed in the United States on May 31, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Seems to work well. Nice length, color, charges fast. Good quality",
    "title": "Like it",
    "location_and_date": "Reviewed in the United States on June 12, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I was looking for a amazon brand cord to go with my amazon tablet for my kiddos because they short ones they come i leave in the car, and this was perfect size and very durable, great product for a great price",
    "title": "Great Product",
    "location_and_date": "Reviewed in the United States on April 22, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "All the charges have ripped in the same spot. 3 different chargers, 3 different phones, 3 different users.",
    "title": "Don't buy",
    "location_and_date": "Reviewed in the United States on December 9, 2022",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I left this cord plugged into my headphones over night and it overheated and already is not working.  Be cautious when using.",
    "title": "Overheated on first charge",
    "location_and_date": "Reviewed in the United States on May 9, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "We use these in the house for overnight charging. We bought 2 of these. 3-4 months ago we noticed that one device was not charging properly. It took a while to figure out it must be the cord and confirmed by swapping the cords & trying on multiple devices. The lack of charge followed the cord. Neither cord has any outward signs of damage. So, we have one good and one that lasted less than one year with very gentle use. If I had to assess it, I'd say it was a faulty manufactured unit. I guess I'd still buy this in the future... but keeping my eye on it this time ;-)",
    "title": "Faulty after little use",
    "location_and_date": "Reviewed in the United States on April 24, 2020",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I like that it gives me the ability to charge my phone and keep it close by and handy while it charges right from my PC. Very helpful when I need a quick recharge during the day.",
    "title": "Does not charge as fast as the wall charger, but it gets the job done when you need it.",
    "location_and_date": "Reviewed in the United States on May 29, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "After a while you can see you can really treat it as rough as how you would treat a original Samsung USB and the charging power is not really up there",
    "title": "It's not a bad buy",
    "location_and_date": "Reviewed in the United States on September 23, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Affordable 3 ft option. Using for on the go charging.",
    "title": "Basic, affordable",
    "location_and_date": "Reviewed in the United States on March 2, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Its not a fast charge take to long to charge",
    "title": "Not a fast charge",
    "location_and_date": "Reviewed in the United States on January 2, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "We just like most people have a lot of chargers with USB connections. The world has been that way for quite some time. Now things are moving to new USB Type C connectors as they should for a lot of reasons. But it is nice w can still leverage our current USB chargers. Granted it is not as fast as the native chargers that some with the phone but most of us just plug and forget. They worked great fr our new Pixel phones.",
    "title": "Just what the doctor ordered.",
    "location_and_date": "Reviewed in the United States on August 10, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "My daughter's Samsung charger stopped working. I tried several things and realized the issue lays in the cable instead of the charger itself. Found it in Amazon and received in just one day. Working great !",
    "title": "Working great !",
    "location_and_date": "Reviewed in the United States on June 17, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Perfect for charging my LG G6. It's nice and flexible and lightweight compared to the USB 3.0 cable I was using. I have been using it nightly for 8 months now. I frequently plug and unplug it and roll around on my bed with it plugged in, yet it shows almost zero signs of wear. The 6 foot length is ideal. Long enough to reach from my charger on the floor up to my bed, but short enough that it doesn't get in the way if it falls on the floor and packs easily for travel.",
    "title": "Perfect nightly charging cable. 8 months daily use without issue.",
    "location_and_date": "Reviewed in the United States on July 6, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The product is used to charge Bose 700 Headphones",
    "title": "Correct connections as advertised",
    "location_and_date": "Reviewed in the United States on March 14, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Seems durable and works well. I've had good experiences with Amazon chargers in the past and this seems no different. I would buy it again.",
    "title": "Good",
    "location_and_date": "Reviewed in the United States on November 26, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "So far so good.  Just got it, so I will have to do an update at a later date.  Received it faster than I thought I would.  Just wish they would ring the doorbell when a package is delivered.",
    "title": "Good USB-C to USB cable.",
    "location_and_date": "Reviewed in the United States on April 21, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cabel works, connections are tight and does what I need it to do, charging my Kindle",
    "title": "A cable that works as expected",
    "location_and_date": "Reviewed in the United States on January 20, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Use this everyday at work. I've had it for several months now and it still works perfect with very minimal signs of wear.",
    "title": "Still works.",
    "location_and_date": "Reviewed in the United States on November 5, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed a usb-C to A for my new keyboard, since the included cable was too short. this cable is long and has been durable thus far. Love it",
    "title": "Cheap but great",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 20, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought 2 of these to replace chargers that have been lost or broken - fit perfect and work well.",
    "title": "Just what I needed",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 30, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The main reason I bought this cable is because they are small enough to fit devices with cases. Other cables I have  used have trouble with tablet and phone cases, but this one plugs right in to the USB port without a struggle.",
    "title": "Small Enough for Devices with Cases",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 5, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This was good at first for only a short while  and then broke. Had to buy another one.",
    "title": "Cheap and broke",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 27, 2022",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Does what it is supposed to do.",
    "title": "Works as expected",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 1, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Not much to say, other than it does what I need. I take alot of pictures for work, witch is why I bought a Google Pixel 3XL. The phone has it's own unique charger, no direct plug to USB A. So I got this to transfer data. It charges it, but not to standard. It'll delay the batteries death until you put it on original charger. But that's fine, cuase as mentioned, I got this to transfer data. This was a good buy, I'd recommend.",
    "title": "Review",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 20, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "AmazonBasics cables have been rock solid for me. There are plenty of horror stories on the net about cheap cables so I had to go with a major brand. I appreciate the peace of mind I get from Amazon's quality control. My 4-year-old chewed on one and survived (grounded from the tablet for a month), so there's that. It was still working but I recycled it just in case and bought this one to replace it.",
    "title": "Quality, Peace of Mind",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 5, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Just what I needed in my MX-5 for the 'secret' charging port under the passenger side of the dash. This cable was routed behind the dash to the far drivers side for the charger/magnetic holder. Works perfectly.",
    "title": "Perfect cable for what I needed!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 21, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Seems to be of good quality. Using for vehicle for backseat charging purposes.",
    "title": "Would order again if needed.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 22, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     This was a horrifying discovery to make at 5 am. Like I say in the video it burnt my hand, left a mark on my bedside table, and damn near ruined my 3 month old phone and brand new phone case. I have had this charger for not even 5 days and now I can't use it because I'd like my things to not get ruined.",
    "title": "Almost destroyed my phone",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 12, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is a very durable product to use at work. Am able to connect screen to my Laptop using it and simple to use.",
    "title": "Durability",
    "location_and_date": "Reviewed in the United States on September 23, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "3 years and it's still going, it's been abused (by accident) and it hasn't even shown signs of it. Impressed for a cable that I originally thought would last a month lol",
    "title": "3 years and it's still going",
    "location_and_date": "Reviewed in the United States on June 27, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This is one long cable! It works great. I’m very pleased by all the Amazon Basics items I have ordered. They are functional, attractive, and well priced. The availability of these Amazon Basics make replacing accessories hurt less. When you run over the video game controller cable with your vacuum cleaner - Amazon Basics’ Cables come in very handy!!Just to be clear this cable connects the Nintendo Switch pro controller to the system and charges it when connected to either the system or a usb charging brick. You can also find a nicely priced charging brick thru Amazon Basics.",
    "title": "Great Cables!",
    "location_and_date": "Reviewed in the United States on December 7, 2017",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Had to get a new charger after the original got snatched out of the plug a few times and started to come part. This new charger is better than the original one that came with my phone. For one the length is super convenient. And the fact that it has endured the same abuse but hasn't come apart makes me wish that I had gotten this sooner. There's no lag in the charging time like with some other chargers than I've used.",
    "title": "Better than the original Samsung charger",
    "location_and_date": "Reviewed in the United States on June 23, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Tired of buying the Anker brand and others on Amazon and they barely last - and those are the nylon threaded ones. This one is obviously higher quality. I'll change my review if it breaks for no reason. But I love it!",
    "title": "Better quality than the 3 for $7  ones.",
    "location_and_date": "Reviewed in the United States on February 21, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I am older and it’s hard to keep up with all of these new plugs and chargers LOL! This fit all of my needs. Thank you so much.",
    "title": "Exactly what I needed",
    "location_and_date": "Reviewed in the United States on August 17, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Does exactly what it is supposed to. So, we would recommend this seller and this product.",
    "title": "Highly Recommended",
    "location_and_date": "Reviewed in the United States on January 20, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great re-used cable, works great for the function I purchased it for. Recommend!",
    "title": "Charging cable",
    "location_and_date": "Reviewed in the United States on April 14, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought two more Nintendo Switch Pro controllers. I bought Amazon basics USB C cable to connect docking station USB port to Pro controllers. The controllers are charging. Cable is medium weight and stiffer that feels strong and appear high quality. Now, I can charge multiple Pro controllers at the same time.",
    "title": "Nintendo Switch Pro Controller Charging USB Cable",
    "location_and_date": "Reviewed in the United States on July 29, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The last time I bought an HDMI cable from the Amazon brand and it was perfect and this one is not the exception, so far so good.",
    "title": "Perfect",
    "location_and_date": "Reviewed in the United States on August 12, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Fast charging great charging cord",
    "title": "Charge me up",
    "location_and_date": "Reviewed in the United States on March 28, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Slow but it works!!",
    "title": "It does the trick!",
    "location_and_date": "Reviewed in the United States on July 25, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Was listed to work for my phone but didn’t!",
    "title": "Said it works for IPhone 8 but didn’t!",
    "location_and_date": "Reviewed in the United States on May 21, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This charger works great in my car since I have a USB port and needed the conversion to type C for my phone.",
    "title": "works good",
    "location_and_date": "Reviewed in the United States on October 11, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great product!  It actually works, unlike my other recent charger cords, which stopped functioning fairly quickly.  I've had this product for about a month now and it charges my devices (primarily my phone) well!",
    "title": "Great product that actually works!",
    "location_and_date": "Reviewed in the United States on April 16, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I had ordered this 1 year ago and it finally gave out and stopped charging. I decided to give it another try and my USB type C works well and charges the phone relatively quick.",
    "title": "Does it's job well.",
    "location_and_date": "Reviewed in the United States on June 6, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "amazon know what they're doing. I have a tough phone to get and it high speed charged with no problemamazon know what they're doing",
    "title": "amazing product",
    "location_and_date": "Reviewed in the United States on August 17, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It works with no apparent issues, but it isn't very substantial.  Haven't tried it in a fast charge situation because it is much less substantial that other cables we have used.  I don't think it would be a problem but would monitor closely if it is used in that fashion.",
    "title": "It works OK",
    "location_and_date": "Reviewed in the United States on June 26, 2021",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Does exactly what it is for but why is the 6 foot cheaper than the 3 foot cable. How? You gotta star knocked off for that. Other than that it's a decent cable. I normally get my stuff from Monoprice but I needed a cable faster. I got one of these and then 6 from Monoprice.",
    "title": "Yea I knocked it down a star",
    "location_and_date": "Reviewed in the United States on August 4, 2019",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Bought this for my brand new Kindle File HD 10.1. The 6 foot length is perfect to charge the tablet while using it or to read.This is a very flexible cord and the c insert fit perfectly without any effort.Can't beat the priceEnjoy the longer cable for more flexibility.Mark",
    "title": "It is Amazon branded",
    "location_and_date": "Reviewed in the United States on August 21, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It's a USB A to C cable and it works. It's nice that this comes in a 10 foot length and the price is hard to beat.",
    "title": "Good, basic cable",
    "location_and_date": "Reviewed in the United States 🇺🇸 on August 9, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I like this 6ft cable beside my bed to give me enough slack for reading.",
    "title": "Perfect by my bed",
    "location_and_date": "Reviewed in the United States 🇺🇸 on January 22, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Had to replace my MiFi device recently and it uses a Type-C cable, and I wanted to have a couple of spares to keep in different places. So I bought two, one to carry around in my backpack and one to keep at the office. The AmazonBasic cable look nearly identical to the one that came with my new MiFi. I've been using them for a week or two and they both seem to work fine. I'm happy with my purchase.",
    "title": "Bought two",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 17, 2018",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cord length is great. The connection did end up getting bent a little, but still works. Highly recommend it for the length.",
    "title": "Great Distance",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 2, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Overall I am very pleased with this product. Would recommend if a \"C\" type connector is needed.",
    "title": "Fits a newer phone for charging anywhere",
    "location_and_date": "Reviewed in the United States 🇺🇸 on November 3, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "i bought this cable to use to connect my laptop to the TV for presentations etc. worked great. windows picked up the tv as a second monitor. you can even use this cable to connect a phone or any other device that uses USB Type-C. im very happy with this purchase and worked exactly the way that i wanted it. cable seems durable and nothing was wrong with it when i received it.",
    "title": "Great Cable for the price",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 6, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Unlike most power cords that develop shorts at the connecting ends, this cable has remained in working order and trusty.  I use it every day and its durability shows no sign of slowing down.  Finally a charging cable worth the money.",
    "title": "So Far So Good",
    "location_and_date": "Reviewed in the United States 🇺🇸 on December 4, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The charging cables that come with wireless ear buds are practically useless if there isn’t a computer with a USB-A port at hand. So when I got my new buds the first thing I ordered was the three foot cable so I could  plug them into a wall outlet. I’ve used these amazon basics cables for years without any problems.",
    "title": "Good Cables",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 21, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The charger to my sons Amazon tablet was lost and this is the replacement cable. Length of the cable is great and it works as described. Cheaper than products in store by something like $5-$10.Thanks!",
    "title": "New Cable for Amazon Tablet",
    "location_and_date": "Reviewed in the United States 🇺🇸 on February 25, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It worked as stated with my Brydge keyboard that had a type-c connection when I needed it to connect to a standard USB-A connection!",
    "title": "Great cable and a very good price",
    "location_and_date": "Reviewed in the United States 🇺🇸 on July 30, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Overall good , just feel cheap",
    "title": "Great!",
    "location_and_date": "Reviewed in the United States on May 12, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Excelente producto, su poder de carga es similar o mejor que los que he tenido. De igual manera su composición física es duradera y excelente.",
    "title": "Funcioa Igual que el Original",
    "location_and_date": "Reviewed in the United States on July 15, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "My family and I recently switched from iPhones to Google Pixels. In the past I had always used Amazon basics for lightning cables and been happy so I decided to try the for the new phones. I'm happy to report that they are the same quality. They are more durable than the stock cables you get with devices. I also love the fact that they are 6ft. cords. You can't beat the price either. All around they are a great value.",
    "title": "Durable cables for a good price",
    "location_and_date": "Reviewed in the United States on March 5, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works as it should",
    "title": "Works as it should",
    "location_and_date": "Reviewed in the United States on June 10, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great charger I love it",
    "title": "Charger!!",
    "location_and_date": "Reviewed in the United States on March 9, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works just fine.",
    "title": "As advertised",
    "location_and_date": "Reviewed in the United States on March 20, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The charge is fast and reliable 👍🏽",
    "title": "Charges fast",
    "location_and_date": "Reviewed in the United States on April 23, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great price. Very happy with the cables so far. High speed charging and data transfer rate. Seem to be durable.",
    "title": "High Speed charging and data transfer",
    "location_and_date": "Reviewed in the United States on September 27, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Exactly what you need.",
    "title": "Basic",
    "location_and_date": "Reviewed in the United States on March 16, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "So glad I found this since I have a 2018 iPad and I could not hook to my computer or charge it in the car.  I also used this when flying recently as the adapters on the plane do not support the charging end of the new iPad.  Alas though for some reason on one airline, I could plug it in but it still would not charge my iPad.",
    "title": "Glad this is available",
    "location_and_date": "Reviewed in the United States on November 29, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The charging power is great chrages fast if I should ever need another one this would be it",
    "title": "The best",
    "location_and_date": "Reviewed in the United States on October 20, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use this to connect my android phone to the display screen in my new Jeep.  It's perfect to use the display screen for navigation from Google instead of looking at the smaller phone screen..",
    "title": "Great in car!",
    "location_and_date": "Reviewed in the United States on February 27, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I obtained this item to power a wireless charging disk from someone else's throw-offs.  Works great, now.",
    "title": "Gets 'r done 2!",
    "location_and_date": "Reviewed in the United States on October 6, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "After a year or so the plastic began to crumble. I generally expect cables to last longer than that.",
    "title": "plastic degraded quickly",
    "location_and_date": "Reviewed in the United States on October 23, 2022",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "🔥",
    "title": "🔥",
    "location_and_date": "Reviewed in the United States on March 31, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Quik shipping top quality",
    "title": "USB charging cable",
    "location_and_date": "Reviewed in the United States on March 10, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It only keeps my ipad pro at the same charge and it does not charge it up.",
    "title": "Poor charging capability",
    "location_and_date": "Reviewed in the United States on December 9, 2020",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "USB to C. Charges ok. Seems a little flimsy, but time will tell.Using it with a USB to C adapter in an Anker charger.",
    "title": "It's a cable",
    "location_and_date": "Reviewed in the United States on January 6, 2022",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This cable is the best cable for working with android auto, especially with our Motorola phone. It always connects and stays connected. Highly recommend this cable for use in the car.",
    "title": "Cable is great for connecting with android auto",
    "location_and_date": "Reviewed in the United States on April 11, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The cord is quite stiff and obviously rather cheap, but it works.",
    "title": "It's fine.",
    "location_and_date": "Reviewed in the United States on January 7, 2021",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Used it alot and it works as expected. No issue with connectors or cable.",
    "title": "Great USB cable for the price",
    "location_and_date": "Reviewed in the United States on December 3, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This work well with my car charger. My phone charges 3 or 4 times faster than with the previous cable.",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on September 3, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This solved the problem of my car only having a standard usb while my phone has the smaller usb. Now I can charge my phone in the car!",
    "title": "Fits my pixel phone",
    "location_and_date": "Reviewed in the United States on June 6, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges iPad Pro using USB ports in my car and hotels. I like not having to carry the adapter with me at all times.",
    "title": "Charging cord for iPad Pro",
    "location_and_date": "Reviewed in the United States on July 1, 2021",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The Good:-Charges my iPad Pro 11” quickly-Comes In 9 foot-Durable-Great valueThe Bad:-NoneThe Bottom Line:I’m using this cable to charge my my iPad Pro 11”. I needed a 9 foot cable since my plug is pretty far away. The cable has been pretty durable. Overall I would recommend this cable for its value and function.",
    "title": "Need a great value 9 foot USB C to USB A cable?",
    "location_and_date": "Reviewed in the United States on March 19, 2019",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "was looking for a usb-c cable that was compatible with fast-charge phones. I wanted it for my mom's car, as she was using cheap-o dollar store quality chargers. The price for this cable is relatively affordable, seriously, spend the extra few dollars and get this quality cable.",
    "title": "Perfect length for Car, fast charge is a plus",
    "location_and_date": "Reviewed in the United States on September 10, 2020",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The USB end melted while in use. I would not recommend this cord unless you like to live life dangerously",
    "title": "CORD MELTED FROM HEAT",
    "location_and_date": "Reviewed in the United States on April 25, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Working well so far. Fast charge,  too. No complains.",
    "title": "No complains.",
    "location_and_date": "Reviewed in the United States on January 17, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Muy recomendable",
    "title": "Hace lo que promete",
    "location_and_date": "Reviewed in the United States on March 18, 2022",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I use this cable to communicate between my pc and my phone.  Last time, I copied hundreds of songs from my pc to play easily on my phone.  And then through my car's interface.",
    "title": "Works Very Well",
    "location_and_date": "Reviewed in the United States on January 3, 2021",
    "verified": true,
    "rating": "5.0"
  }
]
