[
  {
    "asin": "B01GGKYKQM",
    "text": "This cord functions exactly as you would expect. I mainly purchased this because I wanted this particular length. It's nice to have a longer cord when on a trip in case the available seating is unfortunately quite a distance from the outlet. Overall, I'm pleased with this purchase and I think the Amazon essentials product functions just as well as the more expensive brands.",
    "title": "Practical and Useful Cord",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 3, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "got it while they are on sale.  so  happy with the price and the length of the cable",
    "title": "long, what else do you want from it?",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 1, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I got a 2020 Honda CR-V a few weeks ago. First vehicle I've had with Android Auto support (or Car Play but I haven't owned a iPhone since the iPhone 4, just personal preference).Anyways when I first got it I couldn't not get Android Auto to work. I tried everything I could find online about the problem and you can find plenty of people that have/had trouble getting it to work in their Honda CR-V (ironic since the infotainment system runs on android). Tried doing a full factory reset on the infotainment system, turning on USB debugging in dev settings, and the 2 dif USB type C to USB type A cable I had. No matter it would not work. My phone would charge when plugged in but that's it. A message is supposed to pop up on the infotainment system asking if you want to enable android auto.I bought this cable as a last resort. I made sure to get a USB 2.0 and NOT a USB 3.0 type C to USB type A cable. Didn't think it would make a difference. Got in the car, turned it on, plugged the cable into the car, then into my phone, and BAM the \"do you want to enable android auto\" message instantly pops up on the infotainment system. And it works perfectly. Love it.",
    "title": "Couldn't get Android Auto to work in my new car, this cable did the trick!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on March 17, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This cable allows me to charge the Fire tablet while being able to use it without confining myself to the short length of the cable that came with the tablet.  The charging time is comparable to that of the cable that came with the tablet.  It was reasonably priced, so I bought two.  So far, so good!",
    "title": "Reliable and reasonably priced",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 5, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "My experience with Amazon Basic products is that you get Quality Products for a Great Price! And, this cable is no different. The cable does everything advertised.  And, there's one thing I've learned as a buyer on Amazon is that AMAZON does not put their name on anything unless it's GOOD QUALITY.  So far, I've always been happy with Amazon Basics Products and I never worry about my purchase.",
    "title": "A Quality Cable that Does the Job.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 2, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "it works great for charging my vapes and has a decent length cord",
    "title": "does what it’s supposed to",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 31, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "These short cords are perfect to use with a USB HUB in order to create a USB charging hub for your devices.",
    "title": "Perfect for a creating a charging hub",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I bought a product which needed this kind of cable. My iPhone is a newer model, but the product I ordered did not use the cord or the charging station that I have. I’m always reluctant not to purchase Apple products, but this Amazon cable is just as good and the price point is fabulous. I only believe in giving honest reviews. I am a Vine member, but I paid for this product. Even when I receive the Vine products, I will rate them as if I did purchase them. If you do need this kind of cable, I highly recommend it, thus, the five stars.",
    "title": "Just As Great As Apple",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 13, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I recently purchased the Amazon Basics USB A to USB C cable and wanted to share my experience with fellow shoppers. Overall, the cable does its job well, but there are a few aspects worth mentioning.First, let's talk about the positives. The cable functions reliably and effectively connects my USB A devices to my USB C devices. I haven't experienced any connectivity issues or data transfer problems so far, which is crucial when it comes to cables.However, one notable drawback of this cable is its stiff jacket. The cable's outer covering feels rigid and inflexible, making it a bit challenging to maneuver and position as desired. Although this stiffness can be attributed to the cable's durability, it may be a point of concern for those seeking a more flexible and pliable option.That being said, if you're primarily looking for a durable cable that can withstand some wear and tear, this might be a suitable choice for you. The cable's build quality appears to be solid, and it feels sturdy enough to last for an extended period. Just keep in mind that the trade-off for this durability is the cable's rigidity.",
    "title": "Reliable Cable with Stiff Jacket",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 2, 2023",
    "verified": true,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I buy my phones from TracFone, and there's usually a charging cord included. However, this newest cord with the phone doesn't stay securely plugged in and tends to pop off when I move the device. I ordered this one, hoping for better results. This cord stays plugged into my phone better than the other one, is a good length, works great. Winner!",
    "title": "Better fit",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 25, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "I got these for my brother who has problems with fine motor skills and is prone to breaking chargers.  I've had to dig the broken tip out of an iPad a couple of times now, but this cord allows him to easily charge and remove the device himself.  I think they're perfect for us.  I've heard people say that magnetic chargers like these don't charge as fast, but even if that's the case, it's worth it to me to have a charge my brother can use himself that I don't have to replace every couple of weeks and that can be used for more than one type of device.",
    "title": "I haven't had it very long, but seems to be perfect",
    "location_and_date": "Reviewed in the United States 🇺🇸 on June 1, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Previously purchased, 1 year of use, changed the way our family charges. It's not the fastest charging speed, but it's so inexpensive and hassle free. This is the slickest thing for easy, reliable, effortless, ...almost doing the connecting (hooking of phone and charger together) is done by themselves automatically! My wife and I now have two in the car, two in the bedroom, two by our comfy recliners.  I initially bought because I am over time wearing out my mini-usb female connection located on the bottom of my phone. ... so this connector is the connector of first choice. This is the connector you HAVE TO HAVE!",
    "title": "Buy Endlesshine cable again",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 7, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Cable works, but small tips often left behind in device's socket, sometimes requiring pliers to remove.",
    "title": "Tips come off in device socket - sometimes difficult to remove",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 12, 2023",
    "verified": true,
    "rating": "2.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "I am highly disappointed with this purchase, what you see in ads, these cords are not either designed or made to work that way . For example they are supposed to be fast charging, not even fast but they will charge at a snails pace, I had to go back to using my old cords for a fast charge.Next the magnetic tips are not are strong as shown in the ads they continue to fall off even after I wipe them off.Basically you can do much better and cheaper buying cords from anywhere that will charge faster than these",
    "title": "Not what you expected!!!!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 22, 2023",
    "verified": true,
    "rating": "1.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "This charging system really is very useful. This is the one single Amazon find that I have proselytized to others and encouraged them to use.  I've used this type of charging system for years.  I love it.  This particular order was to replace a couple cables and plugs that have eventually disappeared or were damaged over the years. I hesitated to write this review; not because it's bad --  the product is great. But because i find the super-gushing reviews where everything is perfect (insert multiple exclamation points!!) to be sus.  And today I'm writing a review that I'm afraid will sound gushing. The two parts are (a) the metal head/plug that stays in your phone, plus (b) charging cable with a magnetic connection the little metal head. The system includes multiple small metal heads for USB-C, iPhone Lightning, and micro-USB. These insert into the phone or device and stay there, although you can remove them at any time if needed. The cable has a magnetic end that automatically snaps to the head to connect and charge it.Pro:- One-handed operation -- Really simple & easy to connect the charge cable to your phone, every time.  You can do it one handed if needed; just get the magnetic end of the cable close and it snaps in place. I can plug in the cable in the dark or while bouncing down the road in a car.- One cable to rule them all --  I have devices that use UBS-C, and devices that use Apple Lightning and others with Micro-USB.  This system allows me to use one cable for all three. I only need to carry one cable rather than three cables for three (or more) devices.- Prevents damage to charge port -- The magnetic connection is strong enough to hold the weight of my phone if i lift it gently, but it will become disconnected if I happen to trip over the cable or pull hard for whatever reason.  This helps to prevent damage to the phone's connection port that can occur if a normal cable is pushed or pulled too hard to the side while connected to the port.- reduces wear & limits pocket lint from clogging the phone's charge port -- yah, this is minor; since the head/plug stays in your phone, it fills the charging port and mostly blocks dirt, dirt, lint, water, whatever from getting into the charge port.Con:- Charging only -- These cables do not include transfer data. ...on the plus side, you can connect to a public (eg: airport) charge port without fear of your data being accessed.  At least not through the cable.- Limits Fast Charging -- Occasionally, my phone has performed fast-charging through the magnetic connection, but not usually.  Personally, that is fine with me. Normally I'm near a charger long enough (overnight) that I don't utilize the fast-charging feature.- Sometimes need to remove the head/plug -- You may need to remove the metal head before taking off a phone case.  but you would need to unplug a normal cable too.  Likewise, if you have to borrow a normal cable, then you would also need to remove the head.Thanks for reading; hope this helps someone!",
    "title": "Writing this review is painful.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 5, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "What I like about this set:1) it has two long cables and one regular length - nice assortment2) I love the swivel function on the cables ends3) very convenientWhat I did not like about this set:1) could use more tips - comes with 3 USB-C, 3USB Micro, and 3 Lightning tips - I quickly ran out of the  USB-C type so maybe 5 or 6 of each would be more useful, even if it cost a little more.Finally, I do not know how durable this set will turn out to be but will update after a few months.",
    "title": "Good value and convenient",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 14, 2023",
    "verified": false,
    "rating": "4.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "I really like these charging cables. The swivle head and the ability to change the tips to fit whatever device is great. My only issue is that getting the tip out of the device is problematic. Typically the tip releases from the cable and you have to pry the tip out. Maybe with a little wear the tips might release easier. Overall I like them and will continue to use them.",
    "title": "Works, but...",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 17, 2023",
    "verified": false,
    "rating": "4.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "These work well enough.  They fit the phone just fine and the stay in place.  The magnet is a little weak and they are not fast charging.",
    "title": "Not fast charging",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 27, 2023",
    "verified": false,
    "rating": "4.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "You get a couple cables and usbc microusb and lightning connectors.Suoer simple to have one cables with multiple endsLeave the end in the phone for less scratches when trying to find the hole.I would recommend these cables.",
    "title": "Nice cables",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 15, 2023",
    "verified": false,
    "rating": "4.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "This cords setup is great for those extra accessories in your life.  Do you have a wireless setup at your desk that takes different cable connectors, this is a great for that.  One cable to charge whatever you need at whatever time.  Do you not use wireless charging, and you have bluetooth earbuds that you travel with, slap one of the plugs in there and BOOM, you are set, with an extra cable.  These are great for those devices that don't take lots of power to charge.Things I loved:More connectors that are all interchangeable with the cablesHigh Quality CablesGreat valueThings I loved less:This really should be a USB-C connector, not USB-ADoes not charge fast at allHonestly, even with those drawbacks, still worth it for those who have desk setups with wireless devices.  Not all devices loose power at the same time, so there will be times where you headset can charge, but, you keyboard is fine.  Having 1 cable switching between them verses having 2 or 3 always connected is a wonderful things when you are trying to have a clean desk.  You should buy these.",
    "title": "Great for those extra accessories in your life",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 16, 2023",
    "verified": false,
    "rating": "3.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "This product works well and does what it is supposed to do. The battery life on PS5’s controllers are awful, so needed a longer cord so I could play from my couch. Works really well",
    "title": "Needed a longer cord for my ps5 controller",
    "location_and_date": "Reviewed in the United States on May 12, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Worth it. works great. charges fast and it’s long",
    "title": "Great",
    "location_and_date": "Reviewed in the United States on May 27, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Works fine for my IPad Air 4th gen. Hope it holds up.",
    "title": "Works fine",
    "location_and_date": "Reviewed in the United States on May 23, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "",
    "title": "Great length, fairly well made. Lasted about 2 1/2 years before coming apart at the connector.",
    "location_and_date": "Reviewed in the United States on May 29, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges all of my Type-C devices.",
    "title": "Works perfeclty!",
    "location_and_date": "Reviewed in the United States on May 26, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": ".. stopped working shortly afterwards.  Amazon quickly replaced it for free without having to return the old cable.  Hey, **it happens, still a good experience.",
    "title": "Worked great, but..",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does what it's supposed to do. Works great.",
    "title": "Its a usb cord that does usb cord stuff.",
    "location_and_date": "Reviewed in the United States on May 22, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "No problems!",
    "title": "Great charger",
    "location_and_date": "Reviewed in the United States on May 26, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "👍",
    "title": "works on xbox controller",
    "location_and_date": "Reviewed in the United States on May 28, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The charger was packaged Great. Charger looks well made and chargers my phone well. Highly recommend for the price.",
    "title": "Great Charger, Great Build Quality. Works well.",
    "location_and_date": "Reviewed in the United States on May 12, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Magnetic headed cords seem to be all the rage these days so I decided to try these. First of all, they came with an instruction sheet that you need a magnifying glass to read. Second, this sheet showed 3 types of cords, but it was not clear which one I actually received. Finally, I tried the micro head on a waterproof speaker which has an inset plug. The head on these cords is much larger than a typical core and it did not fit properly into the opening. It was close, so I pushed a little harder, but still not a good connection, so I tried to remove. Of course it disconnected at the magnet and left the charging head in the device. In trying to remove the head it broke off in the device. Fortunately there was a tiny piece sticking out that I could grab with needle nose pliars. Used on a phone, with a more normal outlet, they work fine and pivot easily. I guess you just need to be careful what you use these for.",
    "title": "Works ok, but ...",
    "location_and_date": "Reviewed in the United States on April 16, 2023",
    "verified": false,
    "rating": "3.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Very cool technology.  I also like the fact that it prevents dust and pocket debris from collecting in your connection.  They point out it cuts down on wear and tear as well.  That would certainly be the case because you now only hook it up once compared to hundreds of times.I used this on my fitness tracker, Bluetooth headphones, PS4 controller and headband flashlights.  You can now attach the charging cables with only one hand instead of two.  I leave a cable connected to the PC and one to a wall outlet charger.  I initially didn't think much about the swivel type magnetic head, but it actually allows the cable to keep from binding automatically.  Neat.It is great to receive an assortment of magnetic USB heads.  This gives you more options on connecting to different devices.  The cables appear flexible and sturdy.  Maybe needlessly so.  There will not be a lot of strain at all when using these.  They also plug in firmly to a USB port.  There is a small blue LED light on the device end of the cable.  It sort of gives it a Hi-Tech vibe.I am sure I will find more devices that can take advantage of this cool product.  Or even purchase new devices that can connect with these.  I wish there was an option to purchase more types of heads.  Three cables seem adequate, but there are so many devices that I can anticipate using with this type of charging cable.  Great product.",
    "title": "If you can't charge wirelessly...",
    "location_and_date": "Reviewed in the United States on May 4, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Charges well, swivels easy.  Connection at swivel a bit delicate, so extra care must be taken not to break the cables.",
    "title": "Pretty good",
    "location_and_date": "Reviewed in the United States on April 18, 2023",
    "verified": false,
    "rating": "4.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "These cables are the answer to my charging woes. Over the years I’ve gone through countless pricey cords that invariably get bent, frayed and peel at the weaker part -where the cord meets the plugs- and I wished that multidirectional cords like these had been available all along. No more bending, fraying and having to purchase spare cords in the foreseeable future.The pack comes with two 78” long, fiber-encased (not plastic) and very flexible cords, as well as two sets of three different tips (six in total) to use with pretty much all kinds of phones, tablets and other electronics, and the same cord can be used will all of them as the connections are magnetized. I leave the plugs attached to my Samsung phone and iPad, so it’s extremely easy and convenient to simply attach the magnet end of the cord to the plugs, without having to wiggle them in place. These cords charge at roughly the same speed than regular cords do, so I have not noticed a significant difference.I cannot tell how durable they are, but I’ve been using them daily for weeks and they remain in pristine condition, with no noticeable deterioration. I do recommend this product.",
    "title": "Charging cables with an advantage.",
    "location_and_date": "Reviewed in the United States on April 30, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Having a magnet wire on end for the usb connection to the wire with a 360 degree turning of the wire as you move is a grt idea from damaging the usb charging port or the wire itself we’re it brakes all the time from being bent with older versions of wire.  Now I got a magnetic usb pin put into what ever system I may use since they give you each type of usb connection you may need. And since I got 3 wires I have plenty of same and different usb end to plug into items.  Once I plug it in that item they stay there. No need to pull em out. I just have a wire for em plug in we’re ever I may need them and when I move from one spot to other I just have to use the magnetic wire to reconnect to the magnetic usb pin.  No more worries of damaging my systems charging port from pullling the old style usb in and out all the time or having the wire bent and putting pressure on that port and breaking it that way.Only negative got to say is I do wish the magnet were a little stronger. Have noticed at times a simple movement of item may knock the wire off.All and all I do like this set up. Will continue to use it as a benefit for my charging ports",
    "title": "Works as expected",
    "location_and_date": "Reviewed in the United States on April 22, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "3 in 1 are much more efficient. Powers both old & new tech. No more hunting down different cords for each device.  You can share power cords seamlessly across different devices.I love not having to struggle to plug my phone in every time I get in and out of the car. The magnetic connect is a breeze. It feels so luxurious to just tap and boom, charging!Side note: If you’re like me and drop your phone or lose it while it’s charging, you’ll be sad to realize you can’t reel it in by the magnetic power cords. .",
    "title": "Love it!",
    "location_and_date": "Reviewed in the United States on May 21, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "If I use one of these cables, it can take up to 5 hours to fully charge my Samsung phone. Cable looks good as they mention but too slow charging.Because I keep my phone in a case the insertable connector is outside the case and can pop-off and get lost, as has already happened with one on my connectors.",
    "title": "Slow charging!",
    "location_and_date": "Reviewed in the United States on April 19, 2023",
    "verified": false,
    "rating": "3.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "In my experience, USB cables break frequently because the wire near the charging port gets bent.  The wire breaks and the socket that the wire plugs into loosens and fails.  This product helps with those issues because the connections are magnetic, and allows for a wide range of mothing at the connector, keeping pressure off the cable itself.The magnets are strong, so the cables don't fall off easily and therefore stay connected.The box contains three different-length braided cables, three USB C adapters, three micro USB adapters, 3 apple type adapters, an organizer for the adapters, a tool to remove the adapters, a tool to remove the adapters, cable ties, and a bag.The instructions state to clean the magnetic connectors, to ensure good contact.I have only used this a few days, we will see how this works over time.",
    "title": "magnetic connections, three wires included, usb-c, micro usb, and apple  adapters included",
    "location_and_date": "Reviewed in the United States on May 2, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "The Magnetic Charging Cable is a game-changer. With its 540° rotation and magnetic connection, it provides hassle-free charging for various devices. The 3-in-1 design with USB C, Micro USB, and iProduct compatibility ensures versatility. The LED light adds a convenient touch, making it easy to find and connect in the dark. Whether you need a charger for Android or Type C devices, this cable has got you covered. It's a reliable and efficient solution for all your charging needs.",
    "title": "Braided design good quality",
    "location_and_date": "Reviewed in the United States on May 18, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "I love these magnetic charging cable for the following reasons:1.  comes with 3 each of USB-C, Lightning, and micro-USB connector tips which are designed to stay connected with your electronic devices. It protects the charging ports from constant plugging/unplugging and dust build up.2.  I leave the 3 charging cables at various locations in the house (office, kitchen, bedroom, etc). My 9 devices can then connect to any of the 3 cables at anytine, thus not having to deal with separate wall plugs for each device.3.  charging process is so much easier, no more fumbling in the dark. The magnetic cable connect to the tips with a satisfying click.4. The end of the charging cable can swivel 360 degrees & bend to 90 degrees for better convenience & ergonomics. There is a LED at the connector that light blue to indicate power.5.  Reduces cables & wall plugs clutter by consolidation. The same cable can now charges 3 different type of connector.  For example, you can charge an Android phone, then an iPad, and then a flashlight without unplugging or changing anything. One handed operation to connect to a new device and you're done!!!",
    "title": "I wish all electronic devices come with this type of charging mechanism",
    "location_and_date": "Reviewed in the United States on April 14, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I purchased this cable to use with Spotify Car Thing to use the display/controls at my desk. The cable shipped with the Car Thing from the manufacturer was defective and constantly had issues. This cable from Amazon Basics has worked great and I have had no issues.",
    "title": "Works great with Spotify Car Thing",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 24, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The Cooler Master SK630 keyboard connects to the computer via a detachable USB-C cable. The problem is the spot it plugs into is recessed somewhat and has very little clearance on either side. That means that most USB-C cables out there won't be able to plug completely into it making the keyboard useless.The C connector on this cable, though, is just small enough that it fits into that spot! Now my keyboard is back up and running.",
    "title": "Good replacement cable for Cooler Master SK630 keyboard",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 7, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "ok",
    "title": "ok",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 22, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Super affordable, does the job just like an Apple product, and arrived after 1 day! Bought this one because Apple products for USBC accessories are very expensive. Definitely recommend!!",
    "title": "MacBook compatible and works like a charm!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 2, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does the job of connecting my touch screen the the Radio.",
    "title": "About as good as it gets.",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 2, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "They are perfect. Thanks",
    "title": "Cell phone charger",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 13, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "The product arrived quickly, I plugged it in and no issues, bought another one.",
    "title": "Arrived Fast Good Quality",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It works great thanks!",
    "title": "Works Perfect!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charge my iPad mini",
    "title": "Works perfectly!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 9, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It does what it should",
    "title": "Works as expected",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 8, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Perfect as described and no complaints!",
    "title": "Perfect for my tech",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 21, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "It's incredibly convenient to charge my phone with these charging cables. All I have to do is leave the tip attached to my phone,  it prevents any dirt or grime from accumulating. Whenever I need to charge it, I simply connect the charging cable without having to reinsert the tip. Additionally, the magnetic connection is impressively strong.",
    "title": "magnetic connection is impressively strong",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 3, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "These are high quality cables. Thge magnetic ends are perfect for charging or connecting just about anything. Highly recommended",
    "title": "Great cables",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 11, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Perfect Magnetic Charging Cable for multiple phones. Android and Iphone supported. Good quality and no issues to date. Highly recommend to others.",
    "title": "Exactly what I needed",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 9, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "This has worked perfectly. The magnetism is just about the right strength. It can take a bit of a tug and still keep charging but a swift pull will free up your phone. The rotating cable tip is also extremely useful so that the magnetic cable won't come off so easily, especially when tossing and turning in bed. There is a blue light that is continuously on but it's not too bright or annoying.My favorite part is that there are two 6.6 ft cables so that my wife and I could each have our own. There are also 2 USB-C ports for us to use. The nylon braid definitely seems strong. No complaints.",
    "title": "2 Long Durable Cables and 1 Short",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 15, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "After trying several other  of these magnetic chargers in the past, I found that they ended up being a waste of time and money. Glad to say that these actually work as advertised, and the swivel magnetic end is a real cable saver! Enough magnetic nibs for the whole family, and a couple extra devices. Charging seems to be just as fast as with a solid cable. The part that fits in your phone is tiny, and even fits underneath my case. Good stuff highly recommended.",
    "title": "Super Cool Swivel Magnetic Charger Works Flawlessly",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 13, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "These cables are just too awesome, it comes with 3 adapters for IPhone, or Android plus 3 cables including a 6’ one, a 3’ and a 5’, put it on your phone, tablet like I have and it won’t get tangled because the cable rotates, really strong magnets keep it all together. This will be the last cables I will purchase, they are great",
    "title": "Real neat set of phone, Tablet charging cables, best that I have seen",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 13, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Got this to supplement another set I'd bought previously but needed more cords and adapters. These work just as well as my previous set and the adapters fit very nicely in the devices I've connected. No issue charging any devices even those that need 2 amps for fast charging.",
    "title": "Nice set of mag charging cables",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 17, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "These magnetic chargers are really easy to use and super convenient! There is a trade off of slower charging with these but usually isn't a problem because I can charge my phone more often because it's just so easy to connect! Can't ever go back once you switch just because it's so nice!",
    "title": "Perfect for convenience!",
    "location_and_date": "Reviewed in the United States 🇺🇸 on April 17, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "This product works exceedingly well with no issues.  I love magnetic chargers",
    "title": "Magnetic Charging Cable [3Pack 3.3/6.6/6.6FT] 540° Rotation",
    "location_and_date": "Reviewed in the United States 🇺🇸 on May 27, 2023",
    "verified": false,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "As advertised.",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on April 27, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges phone quickly.",
    "title": "Charges Phone",
    "location_and_date": "Reviewed in the United States on May 11, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Ordered two of these and I highly recommend. Great price and rapid charging. After I saw how good these were I ordered two more. GREAT QUALITY PRODUCT.",
    "title": "Rapid charging",
    "location_and_date": "Reviewed in the United States on April 21, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "It was as described.",
    "title": "Great! As described.",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Funciona excelente",
    "title": "Buena calidad",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed a way to charge my iPad from an external battery when our power went out.  My external batteries only have the older usb ports.  So these filled that need.",
    "title": "Perfect for my purpose",
    "location_and_date": "Reviewed in the United States on April 15, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Esperaba un cable como todos los genéricos ya que no buscaba uno en especial, pero este Cable USB Tipo C de Amazon tiene una muy buena calidad.Recomendado!",
    "title": "BUENA CALIDAD",
    "location_and_date": "Reviewed in the United States on April 16, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "I needed a longer charging cord to relocate the chargers away from under my rolling chair base to prevent crushing damage, and this one let me put the chargers on the other side of my desk from the chair.",
    "title": "It fits",
    "location_and_date": "Reviewed in the United States on April 10, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Great Buy",
    "title": "Great Buy",
    "location_and_date": "Reviewed in the United States on May 6, 2023",
    "verified": true,
    "rating": "5.0"
  },
  {
    "asin": "B01GGKYKQM",
    "text": "Charges fast but on rare ocassion my phone will indicate slow charging. Just have to unplug and plug back in and that usually fixes the problem.",
    "title": "Works well",
    "location_and_date": "Reviewed in the United States on March 25, 2023",
    "verified": true,
    "rating": "4.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "The magnet on the cable fell off after about a week of use, only charging at night, this happened with 2 of the 3 cables!",
    "title": "Came apart after a few days of use",
    "location_and_date": "Reviewed in the United States on May 15, 2023",
    "verified": false,
    "rating": "2.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "Charges my cell phone, and it is very slow, compared to other charging cables",
    "title": "Charge is very slow",
    "location_and_date": "Reviewed in the United States on March 30, 2023",
    "verified": false,
    "rating": "2.0"
  },
  {
    "asin": "B0BPR6FL7M",
    "text": "It doesn't work with any of my devices.",
    "title": "DOESN'T WORK ON LV-60 OR SAMSUNG",
    "location_and_date": "Reviewed in the United States on April 10, 2023",
    "verified": false,
    "rating": "1.0"
  }
]
